{"data":{"site":{"siteMetadata":{"title":"bono's blog","author":"bono"}},"markdownRemark":{"id":"ffa04edd-bc91-5253-b9c8-fb305a22b268","excerpt":"박차고 나온 직장, 의미 있는 뭔가를 하고 싶었습니다. 허나 거의…","html":"<p>박차고 나온 직장, 의미 있는 뭔가를 하고 싶었습니다. 허나 거의 7 년간 내게 의미 있었던 것을 단숨에 그만둔다는 것은 쉬운일이 아니었습니다. 때마침 대학때 뜻이 맞던 친구가 저와 비슷한 시기에 비슷한 고민을 하고 있었지요. 그래서 저희는 자연스럽게 앞으로의 일에대해서 많은 고민과 대화를   하게 되었고, 마침내 둘이서 뭔가를 해보자는 결론을 내렸습니다. 즉, 사업한번 해보자는 것이었죠. 우리의 결심은 일사천리로 진행되었습니다. 그리고 저를 회사에 뽑아주셨던 회사 대표님께 뭔가 더 가치있는 일을 하기 위해 회사를 그만둬야겠다고 말씀드렸습니다. 의외로 대표님은 흔쾌히 보내주셨습니다. 같은 동문이라 애착이 있으셨을법도한데 제 결심과 표정을 보고 제 마음을 바꾸지 못할꺼라는 것을 아셨을지도 모르겠습니다.</p>\n<p>막상 회사를 그만두었지만 앞으로 어떻게 해야할지 막막했습니다. 회사를 그만두긴 했지만 그만두기 전에 충분한 준비를 하지 못했었고, 회사를 나와서 준비하면 될거라는 안일한 생각에 빠져있었습니다. 게다가 저는 결혼하지 몇 달 되지도 않은 상황이었습니다. 제 마음대로 회사를 관두기 힘든 상황이었었죠. 하지만, 와이프는 참 고맙게도 저의 뜻을 높게   사주었고   당분간은 힘들겠지만 앞으로는 잘될거라며 굳게 믿어주었습니다. 당시에는 자본금을 마련하기도 힘들어 처음에는 까페를 전전하며 커피 두잔으로 사무실 비용을 대신했었지요. 그렇게 매일같이 마시는 두 잔의 쓰린 커피로는 도저히 안되겠다 싶어서 결국 친구집 빈방에 사무실을 만들었습니다. 처음에는 그럭저럭 쾌적한듯 느껴졌습니다만, 시간이 지날수록 친구의 ‘집’ 이라는 사실이 발목을 잡더군요. 게을러지고 의미없이 보내는 시간들이 많아졌습니다. 그래서 또다시 이사를 감행했습니다. 친구 삼촌이 쓰시는 사무실 한켠에 파티션을 설치하고 책상 두개를 만들어 사무실로 사용했었습니다.</p>\n<p>처음 친구와 저는 먼저 무슨일을 해야할까를 고민하기 시작했습니다. 회사를 관둘때 생각했던 우리에게 가치 있는일, 또한 사회에 긍정적인 영향을 끼칠 수 있는 일이 과연 무엇인지 부터 찾아보았지요. 당시에 ‘사회적 기업’이라는 사회의 이익을 위한 일을 하는 기업이라는 형태가 유행하던 시기였습니다. 기존의 기업들은 이익의 극대화를 위해서 존재한다면, 사회적기업은 소수자들의 자립을 도와준다거나 우리사회나 나아가서는 전 지구적으로 도움이 되는 일을 하자는 취지에 그 존재목적이 있습니다. 저희는 이거다 싶었습니다. 그때부터 사회적 기업 관련 책을 읽거나 세미나, 행사 등을 찾아 다니며 사회적 기업이 무엇인지 공부하기 시작했습니다.</p>\n<p>사회적기업에 대해 알면 알수록 이건 좀 이상하다 싶었습니다. 당시에 우후죽순처럼 나타나던 사회적기업들은 대부분 투자를 받거나 국가에서 지원을 받아서 사업을 해나가던 경우가 많았는데, 국가의 지원같은 경우는 보통 3 년정도의 임금을 지원해주었습니다. 지원 받는 그 3 년간의 기간동안은 그럭저럭 운영을 해가지만 3 년이 지나고 지원금이 사라졌을때, 자생력을 갖추는 사회적기업을 찾아보기가 쉽지 않았습니다. 결론부터 보면 3 년정도 흐른 지금에 와서 보면 그때에 등장했던 수많은 사회적 기업들 중 지금도 존재하는 기업은 많지 않습니다. 저희는 그 때 사회적 기업이라는 것은 한때 유행에 지나지 않을것이고 조금만 있으면 거의 사라질 것이라는 것이라는 생각이 들었습니다. 간단하게 생각만 해보아도 보통의 기업도 돈을 버는 것이 쉬운일이 아닌데 하물며 기반도 부족한 젊은이들이 사회에 공헌하면서 돈도 벌겠다라는 것이 얼마나 어려운 일인지 알 수 있습니다.</p>\n<p>이대로는 무리라고 판단이 되어,  생각을 조금 바꿔보았지요. 우리가 꼭 사회적 기업이라는 틀에 갖힐 필요가 없다. 그저 우리의 생각에 적합하면서 우리가 원하는 개인적 가치, 사회적 가치를 실현할 수 있으면 되는 것이다. 이렇게 말입니다.</p>\n<p>틀에 얽매이는 생각을 조금만 비틀었을 뿐인데 그때부터 여러가지 아이디어가 나오기 시작했습니다. 몇달의 시간이 흘러 아이디어를 추리고 발전시키고 정제하는 과정을 계속해서 반복해갔습니다. 그러던 중   하나의 완성된 아이디어가 나오기 직전, 이제 투자 받을수 있겠구나 생각하던 시점에서 뭔가 잘못됐다는것을 깨달았습니다. 우리가 생각한 아이디어는 IT 를 기반으로 하는 벤처들의 창업과 유사한 형태였습니다. 그런데 친구나 저나 IT 와는 전혀 상관없는 인생을 살아왔기 때문에 당장에 우리가 기획한 것을 베타버전이라도 만들어보려면 개발자가 필요했습니다. 우리는 기획을 하면서 꿈을 꾸고 있었는지 현실적으로 만들어 낼수 있는지에 대한 필터링도 전혀 없었기 때문에 더더욱 개발자의 안목이 필요했었지요. 우연히 친구 아는 분이 개발분야에서 일하고 있어 우리가 기획한 것을 간단하게 보여드렸습니다. 우리가 이 분을 모셔올 수는 없더라도 이렇게 기획한 것이 과연 얼마의 시간동안 얼마의 인력으로 가능할지에 대한 기준이라도 알고 싶었습니다. 대답은 우리의 상상했던 것 이상이었습니다. 1 년 이상의 개발기간에 최소 2~3 억은   필요하다   답해 주셨습니다. 하늘이 무너지는 줄 알았습니다. 아무리 우리가 개발적 지식이 전무하다고 했지만 이정도로 우리의 상상과 현실의 갭이 클줄은 몰랐지요.</p>\n<p>아무런 해결책도 기대도 없던 그 때 거대한 인터넷 기업에서 우리가 생각했던 서비스와 매우 유사한 것을 내놓겠다는 발표를 보게 되었습니다. 기획한 서비스와 완전히 똑같지는 않았지만, 뭔가 잘못됐다는 것을 직감할 수 있었습니다. 혹 우리가 지금까지 꿈을 꾸었던 것이었을까?  불안한 마음도 들었습니다. 예상보다 경제적, 시간적으로 무리라는 조언에 낙담한 상황에서 업친데 덥친격으로 유사 서비스의 발표까지 나오다 보니 이걸 정말 할 수 있을까라는 의구심마저 들기 시작했습니다. 당시에 친구와 저는 서로 말하지는 않았지만 더이상 우리가 하려고 했던 이 사업 놀이(?)는 여기서 끝내야한다는 것을 어렴풋이 느끼고 있었는지도 모릅니다. 결국 누가 먼저랄것도 없이 여기서 그만 두는게 맞는것 같다고 서로 얘기하게 되었지요. 8 개월간 꾸었던 꿈을, 이제는 깨어날 때가 되었던 것입니다. 그리고 이후 우리는 헤어져 또다시 각자 서로 다른 가치를 찾기 위해 각자의 길을 찾아 나서게 되었습니다. 시간이 지난 지금 돌이켜보면, 사실 이 유사한 서비스의 등장이 결정적인 원인이었다 생각하지 않습니다. 그 8 개월 동안 단 한번도 절실하게 원하지 않았기 때문에, 그렇기 때문에 단 한번의 위기로 와르르 쉽게 무너져버린것은 아닐까요?</p>\n<p>좋은 경험이었습니다. 결과는 없었고 과정만 있었지만 많은 고민을 하고 생각을 나누고 아이디어를 쏟아내는 그 과정들은 저에겐 건축과는 또다른 형태의 재산이 될 수 있었습니다. 값진 경험이었습니다. 그리고, 사업은 이렇게 하면 안되는구나(?)라는 것도 알게 되었지요. 특히 IT 벤처를 시작하려면, 확실한 아이디어와 실현할수 있는 기술을 가진 누군가가 꼭 있어야하고 어느정도 현실화가 되기전에는 회사를 그만두지 않는게 좋다는 교훈도 얻게 되었습니다. 이제 저는 또다른 길을 가게 되었습니다. 나이 서른이 다되어서 또다른 일을 결심할 수 있는것이 행복한 것인지 불행한 것인지는 모르겠습니다. 하지만 지금까지의 경험이면 무슨일을 하던지 새롭게 도전할 수 있을것만 같았습니다.</p>","frontmatter":{"title":"건축에서 프로그래머로(2) - 사업 한번 해볼까?","date":"October 15, 2014"}}},"pageContext":{"slug":"/from-architect-to-progammer-2/","previous":{"fields":{"slug":"/presentaional-component-container-component/"},"frontmatter":{"title":"[번역] 프레젠테이션 컴포넌트와 컨테이너 컴포넌트"}},"next":{"fields":{"slug":"/think-about-my-writing/"},"frontmatter":{"title":""}}}}