{"data":{"site":{"siteMetadata":{"title":"bono's blog","author":"bono"}},"markdownRemark":{"id":"f7c3e72f-2f7f-5167-8424-461d2bdf3433","excerpt":"…","html":"<p>나는 자기애가 강한편이다. 아니, 강한편이라 생각했다. 그래서 나는 변하지 않으리라 생각했다. 결혼을하고 아이를 낳아도 내 자아는 그대로 유지될꺼라 굳게 믿었다. 우리 부모세대 처럼 자식만 바라보며 살고 싶지는 않았다. 우리 부모들은 자식의 일이라면 어떤 일도 마다하지 않았다. 주말이 없는 삶도 마다하지 않았고, 매일같이 밤늦은 퇴근도 마다하지 않았다. 자식이 원하는게 있으면 어려운 형편에도 뭐든지 사주려했고, 자신이 입는 옷은 낡아서 구멍이 날때까지 새옷을 사는 법이 없었다. 모두 자식의 성공과 행복을 위해 자신을 희생한다는 마음이 있기에 가능한 일이었다.</p>\n<p>그런 내가 부모가 되었다. 결혼을 했고 아이를 가질 때가 되어 아이를 낳았다. 너무나 사랑스러운 아이가 태어났다. 눈은 나를 닮았고 코는 아내를 닮았다. 머리가 조금 큰게 나를 닮은것 같아 안타까웠지만, 그래도 너무 사랑스러웠다. 너무나 사랑스러웠기 때문에 뭐든지 해주고 싶었다. 음식을 사도 아이가 먹을꺼니까 더 비싼 유기농을 사고, 입는 옷도 비싸더라도 순면으로 된 옷을 사줬다. 아이가 크는 모습을 보는 것 만으로도 더할나위 없이 행복했다. 크게 아프지 않아서 너무 감사했다. 가끔 아이가 아플때면 어떻게 될까 싶어 밤새 간호하기도 했다.</p>\n<p>아이가 점점 커가면서 자아가 생기기 시작했다. 고집을 부리기 시작했고, 기호도 생겼다. 대화가 가능해지니 갓난아기 시절과는 또 다른 재미가 생겼다. 단어를 가르치고 같이 놀아주고 노래를 불러주었다. 놀아주고 선물을 사주고 좋아하는 음식을 사줬을때 아이는 기뻐하고 나를 안아줬다. 아무리 힘들어도 아이의 포옹 하나면 그날의 피로는 씻은듯 사라졌다. 그렇게 정신없이 아이를 키우면서 몇년이 지났고 문득 이런 생각이 들었다.</p>\n<p>‘내가 변한건가?’</p>\n<p>결혼하고 아이를 낳고 아이를 키우다 보니 내가 변한것 같다는 생각이 들었다. 나를 사랑하고 신념이 확고했던 철없는 20 대의 내가 사라진것 같았다. 뭘해도 아이를 기준으로 생각하고 행동했다. 패션감각도 내려놓았다. 패피 정도는 아니었지만, 늘 패션감각이 떨어지지 않도록 아침마다 입을 옷을 신경썼고 옷도 많이 샀다. 그런데 어느 순간부터 옷을 사지 않는다. 옷장에 아이의 옷은 늘어만가는데, 내 옷은 점점 줄어간다. 집도 거의다 아이의 성장에 맞춰졌다. 카페 같은 거실도 포기한지 오래다. 아이가 다치지 않도록 모서리가 둥근 가구로 바꿨고 온 집안은 아이의 장난감으로 넘친다. 정해진 수입으로 지출을 나누다보니 나를 위한 소비는 점점 줄어간다. 커피 한잔 사먹는 것도 아깝고 술 한잔 마시는것도 꺼려진다. 그렇지만 아이를 위한 지출에는 전혀 망설임이 없다.</p>\n<p>이대로 괜찮은걸까? 모든것을 아이의 인생에 맞춰도 괜찮은걸까? 그렇게 나를 사랑하고 확고했던 신념이 이대로 사라져도 상관없을까? 무서운 생각이 든다. 점점 우리 부모 세대처럼 변하는 느낌이다. 어차피 한번뿐인 인생, 내가 없는 삶은 살고 싶지않다. 여행도 포기하기 싫고, 패션감각도 포기하기 싫다. 아이의 뒷바라지를 위한 일이 아니라 정말 내가 원하는 일을 하며 살고 싶다. 자신을 잃어버리 말아야한다. 아이는 크면 언젠가는 내 품을 떠난다. 그렇기 때문에 아이를 키우는 것만큼이나 내 인생도 중요하다. 내가 불행한데 어떻게 아이만 행복할 수 있을까? 아이도 커가면서 자신을 잃어버린 부모보다는 자신의 삶을 확고히 살아가는 부모에게 더 많은것을 배운다.</p>","frontmatter":{"title":"자신을 잃어버리지 말자","date":"July 11, 2018"}}},"pageContext":{"slug":"/2018/07/11/do_not_loose_myself/","previous":{"fields":{"slug":"/2018/07/10/why_work_during_40_hours/"},"frontmatter":{"title":"왜 회사에서 반드시 일주일에 5일동안 하루 8시간씩 근무해야할까?"}},"next":{"fields":{"slug":"/2018/07/15/growth_child/"},"frontmatter":{"title":"아이의 성장, 도전과 응전의 역사"}}}}