{"data":{"site":{"siteMetadata":{"title":"bono's blog","author":"bono"}},"markdownRemark":{"id":"b6012d5c-ded4-5962-af2d-ed5b4cdbe1b1","excerpt":"지금 살고 있는 집에는 에어컨 설치가 안되있다. 에어컨이 없는건 아니다. 무려 2in…","html":"<p>지금 살고 있는 집에는 에어컨 설치가 안되있다. 에어컨이 없는건 아니다. 무려 2in1 에어컨을 가지고 있다. 다만 설치를 하지 않은것 뿐이다. 이렇게 더운데 에어컨 설치를 안한 이유는 한달 후면 다른 집으로 이사가기 때문이다. 애초에 지금 사는 집은 9 개월만 계약했고 만기가 8 월이다(이사는 8 월 초다). 처음 계약할때는 7 월 정도까지 충분히 버틸줄 알았다.</p>\n<p>근데 몸이란게 내 생각대로 되는게 아닌가보다. 더위가 점점 기승을 부리면서 덩달아 내 생각도 바뀐다. 거실에 가만히 앉아 있어도 온몸이 끈적끈적하다. 찬물로 샤워를 해도 고작해야 30 분도 시원하지 않다. 참다참다 와이프한테 얘기했다.</p>\n<p>“에어컨 설치할까?”</p>\n<p>“그럴까?”</p>\n<p>와이프도 더웠나보다. 근데, 이사가 한달 남은 상황에서 20~30 만원을 주고 에어컨을 설치하자니 너무 아깝다. 이사하면 생각지도 못한 이곳저곳에서 지출이 발생할게 분명하다(내 집이라 그렇다. 전세면 덜 들겠지). 힘들더라도 지금 좀 아끼고 이사갈 집에 투자하는게 합리적인 선택으로 보인다. 머리는 이런데, 몸은 자꾸 에어컨 설치를 부추긴다. 또다른 문제가 있다. 딸아이가 너무 더워한다. 하필 나를 닮아서(안 좋은건 다 닮는다) 몸에 열이 많다. 자고 일어나면 머리맡이 축축하다. 땀 흘리고 선풍기 바람 쐬고를 반복하다보니 감기도 걸렸다. 아… 에어컨 설치하자.</p>\n<p>인터넷 카페를 뒤저 저렴하게 에어컨 설치를 전문적으로 하시는 분을 찾았다. 25 만원쯤 든다고 한다. 삼 X 에어컨이라 더 비싸단다. 왜?? 방식이 달라서 그렇단다. 왜 방식을 다르게 만들어 설치할때마다 돈을 더 들게 만드나 생각했다. 그런데, 이 회사 주식을 내가 왜 자꾸 사는거지? 그래도 반도체는 잘 만들겠지.</p>\n<p>우리보다는 딸아이를 위해(?) 에어컨 설치를 결정했다. 결정하고 나서 혹시나 소형 에어컨이 있나 검색해보았다. 왠걸, 실외기가 필요없는 이동식 에어컨이 있다. 가격은 만만치 않다. 대략 30~40 정도한다. 가격이 비싼만큼 시원하긴 하겠다는 믿음이 간다. 좀 생각해보자. 차라리 에어컨 설치는 취소하고 이걸 사는건 어떨까? 에어컨 설치는 한 달 후에 또 해야하지만, 이동식 에어컨은 한달 사용하고 중고로 처분하면 10 만원 정도의 감가상각이 발생한다. 새 제품을 안사고 중고나라를 뒤져 중고를 사볼까? 찾아봤다. 더워지기 시작하니깐 매물도 별로없고 금방 팔린다. 중고가임에도 가격이 만만치않다. 정품에 비해 80~90% 정도로 판매된다. 비싸다. 역시 수요가 많을때 구매하는건 바보짓인가보다.</p>\n<p>조금더 검색해보니 이동식 에어컨은 소음이 엄청나다고 한다. 얼마나 심하기에 ‘엄청’날까? 또 고민된다. 비싼 돈 들여 샀는데 소음때문에 고통받는다면, 이것 역시 최선은 아닌거 같다. 아무리 더워도 한달 꾹 참을까? 돈이 들고 회수가 불가하지만, 에어컨을 설치할까? 중고거래로 비용을 최소화 할 수 있지만 소음을 참으면서 이동식 에어컨을 쓸까? 딜레마다.</p>","frontmatter":{"title":"에어컨을 설치할까? 한달을 참을까? 아니면??","date":"June 28, 2018"}}},"pageContext":{"slug":"/2018/06/28/need_air_conditioner/","previous":{"fields":{"slug":"/2018/06/27/look_and_writing/"},"frontmatter":{"title":"외모와 글쓰기는 반비례 하는가? <서민적 글쓰기>"}},"next":{"fields":{"slug":"/2018/06/30/apartment_dispute/"},"frontmatter":{"title":"아파트 단지간 싸움은 칼로 물베기다?"}}}}