{"data":{"site":{"siteMetadata":{"title":"bono's blog","author":"bono"}},"markdownRemark":{"id":"25ea81c9-b2a0-52cb-b797-35ff6d220644","excerpt":"‘롤모델’ 또는 ‘역할모델’은 위키피디아에 다음과 같이 정의되어 있다. ” 역할 모델(Role model)은 어떤 한 사람을 정해, 그 사람을 표본으로 정하여 성숙할때까지 모델로 삼는 것을 말한다. 이 용어는 로버트 K. 머튼(Robert K…","html":"<p>‘롤모델’ 또는 ‘역할모델’은 위키피디아에 다음과 같이 정의되어 있다.</p>\n<p><em>” 역할 모델(Role model)은 어떤 한 사람을 정해, 그 사람을 표본으로 정하여 성숙할때까지 모델로 삼는 것을 말한다. 이 용어는 로버트 K. 머튼(Robert K. Merton)이 처음으로 사용하였다.”</em></p>\n<p>쉽게 말해 <em>롤모델</em> 은 내가 본받고 싶은 사람이다. 아직은 많이 부족하지만 미래에는 ‘저 사람처럼 살고싶다’고 느껴진다면, 그(녀)는 당신에게 롤모델이 될 수 있다. 롤모델이라는 말이 최근 십수년내에 많이 퍼졌지만, 우리는 이미 어렸을적부터 롤모델이 무언지 알고 있었다. 누구나 어렸을적에 한번쯤 위인전을 읽어보았거라 생각한다. 우리가 어렸을적에는 집집마다 위인전이 있었고, 학교에서도 가장 존경하는 인물이 누구냐는 질문을 수도 없이 들어왔다. 그게 바로 롤모델이다. 롤모델을 선정하는 것은 자신의 성장을 위해 가장 효과적인 방법중의 하나다. 롤모델의 생애와 업적를 따라가면서 그의 인생관이나 철학, 행동 등을 배울 수 있다.</p>\n<p>우리가 어떤 문제에 직면했을때 본인의 판단으로 해결책을 선택할 수 있다. 하지만, 만약 자신의 롤모델이 있다면 그 사람은 이 상황에서 어떻게 행동하고 결정했을까를 상상해볼 수도 있다. 어떤 해결책이 더 낫다고 할 수 없지만, 적어도 내가 본받고 싶어하는 사람의</p>\n<p>입장에서 내린 결정이라면 조금더 신뢰하고 과감히 행동할 수 있지 않을까?</p>\n<p>이렇듯 자신의 성장을 위해 롤모델을 설정하는 것은 매우 바람직한 일이다. 하지만, 롤모델에는 이렇듯 순기능만 있을까? 롤모델을 정하고 그 사람의 인생을 답습하면 성공이 보장될까? 그렇지 않다. 롤모델을 너무 맹신하다가는 자칫 독이 될 수도 있다. 예를 들어보자. 어떤 사람은 롤모델이 너무 자주 바꾼다. 투자에 관심을 가지더니 워렌 버핏이 자신의 롤모델이라 말한다. 그러면서 버핏의 책을 두어권 읽어본다. 또 몇개월이 지나자 이번에는 스티브 잡스 같은 성공한 기업가가 되고 싶다고 한다. 아마 스티브 잡스의 전기를 읽었는지도 모르겠다. 그러다가 또 어느날은 성공한 예술가의 삶, 화려하고 지적이며 존경받는 삶을 꿈꾼다. 이 사람은 왜 이렇게 자주 롤모델이 바뀔까?</p>\n<p>근본적인 문제는 자신이 정말 무얼 원하는지를 모르고 있다는 것이다. 스스로가 어떤 삶을 살아야할지를 모르는 상태에서 성공한 사람들의 단편적인 모습만 보고 이 사람처럼 되고 싶다고 마음먹는다. 처음에는 그 사람의 책을 읽고 그 사람이 어떤 삶을 살아왔는지 공부하기 시작한다. 하지만 이 노력은 십중팔구 오래가지 못한다. 왜냐하면 얼마 못가서 또 다른 사람에게 이끌려 이전에 선정했던 롤모델을 바꿔버리기 때문이다. 이렇게 자주 롤모델을 바꿔서는 아무것도 배울 수 없다. 오히려 <em>여러 사람의 단편적 모습만을 따라하면서 인생을 낭비할 수도 있다.</em></p>\n<p>롤모델은 자신을 발전을 위한 최선의 방법중 하나임에는 틀림없다. 하지만, 롤모델을 선정하기 전에 내가 원하는 삶이 무엇인지를 명확히 하는게 먼저다. 그렇지 않으면 오히려 내 인생을 망치는 독이 될 수도 있다.</p>","frontmatter":{"title":"롤모델이 독이 될지도 모른다.","date":"August 31, 2018"}}},"pageContext":{"slug":"/2018/08/31/disadvantages_role_model/","previous":{"fields":{"slug":"/2018/08/29/face_adjustment/"},"frontmatter":{"title":"페이스 조절이 필요하다"}},"next":{"fields":{"slug":"/2018/09/04/healing_mystery/"},"frontmatter":{"title":"추리소설 작가의 힐링 소설 <나미야 잡화점의 기적 : 히가시노 게이고>"}}}}