{"data":{"site":{"siteMetadata":{"title":"bono's blog","author":"bono"}},"markdownRemark":{"id":"1d06b6bb-a5f7-5f90-b1d2-5d4b805ac5ea","excerpt":"…","html":"<p>처음 신축 아파트에 입주하다보니 생각보다 신경쓸 일이 많다. 구축(연식과 상관없이 신축이 아닌) 아파트에 입주할때는 계약하고 잔금치르고 이사만 하면 대부분 끝이다. 하지만 신축은 알아볼 것도 많고 정도에 따라 추가비용도 만만치 않다. 모든게 새로 만들어진 신축 아파트인데 도대체 뭐를 더 해야한단 말인가? 이상하게 들릴지 모르지만, 사실이 그렇다. 신축일수록 부가적인 비용이 더 많이 든다. 그럼 대체 왜 비용이 많이 드는 것일까?</p>\n<p>입주를 한달 정도 남겨두면 대부분의 단지에서는 입주박람회를 개최한다. 입주박람회를 간단히 설명하자면, 가전이나 가구 또는 각종 인테리어 시공 업체들이 한자리에 모여 예비 입주자들에게 제품과 서비스를 저렴하게 판매하는 행사다. 진짜 저렴하긴 하다. 아니, 저렴한 것처럼 보인다. 그런데 알아보면 아주 조금 저렴한 정도다. 입주박람회 내에서 비교군이 없다보니 업체 사람들 말만 듣고 결정하기 쉬운데, 조금만 더 알아보면 비슷하거나 더 저렴한 곳도 많다. 아무튼, 입주박람회라는 행사에 가보면, 정말 다양한게 많다는걸 알게된다. 타일 줄눈, 욕실 나노코팅, 베란다 탄성코팅, 마루 바닥코팅, 입주청소, 새집증후군, 커튼, 중문, 안전 방충망, 미세먼지 방충망, 인덕션, 음식물 처리기, 이사, 주방상판연마 및 코팅, 붙박이장 등 새집과 관련된 정말 다양한 업체가 행사장에 모인다. 부스에 방문해서 각 업체의 설명을 듣다보면, 이건 정말 해야할껏 같은 기분이 든다. 그렇다고 저렴한것도 아니다. 대부분 적게는 20 만원에서 많게는 수백만원의 비용이 필요하다. 그럼에도 불구하고 내가 처음 들어가는 새집이기 때문에 비용을 들여서라도 좀더 나은 환경을 만들고 싶은 욕구가 샘솟는다.</p>\n<p>나도 입주박람회를 방문하고서 신축 아파트 입주 관련 시장이 이렇게 큰지 처음 알게되었다. 입주박람회를 여는 단지의 경우 대체로 1000 세대 이상인 경우가 많다. 업체 입장에서는 조금 싸게 판매하더라도 한꺼번에 많은 사람에게 판매할 수 있는 입주박람회는 단기간에 매출을 올릴수 있는 절호의 기회다. 공구(공동구매)를 생각하면 쉽다. 사람을 모아서 싸게 판다는 원리는 동일하다. 이렇게 조금이라도 저렴하다보니 사람들이 혹하기 쉽다. 처음에는 별 생각없이 방문했다가도 나올때는 몇장의 계약서와 함께인 경우가 흔하다. 업체의 설명을 듣다보면 정말 필요한것 같고, 하고 싶다는 생각이 들기 때문이다.</p>\n<p>나는 그래도 많이 참았다. 처음부터 하기로 생각했던 것들만 신청했다. 중문, 입주청소, 안전 방충망 이렇게 세가지만 계약했다. 중문은 방음 및 보온을 위해서 반드시 할 생각이었고, 입주청소도 내가 할 수 있지만, 너무 힘들것 같아 신청했다. 안전방충망은 예전에 빌라에 살때 좋았던 기억이 있어 비슷한 브랜드의 더 나은 제품으로 선택했다(그래서 더 비싸다…). 이후에 건조기도 구매하고 세탁기도 새로 샀다. 가스레인지에 미세먼지가 그렇게 많이 나온다고 해서 인덕션도 해외직구로 구매했다. 인덕션을 구매했더니 인덕션 전용 용기가 필요하더라. 그래서 와이프가 예전부터 갖고싶어했던 휘슬러 냄비세트 + 압력밭솥 + 후라이팬(세개 합치면 거의 50 만원ㅠㅠ)을 구매했다. 돈이 계속 나간다. 여기서 끝이 아니다. 딸의 방을 꾸며주겠다고 이케아 어린이 가구도 몇개 샀다. 그리고 드레스룸 규모가 작은듯해서 옷장도 구매했다. 이 넓은 거실에 소파하나 없으면 안되겠다 싶어 소파도 구매했다. 게다가 침대로도 변신하는 녀석이다. 청소가 쉽다해서 주방상판코팅, 욕실 나노코팅도 하고 싶었지만, 코팅 용액 가격에 비해 지나치게 비싸게 느껴져서 셀프로 작업해버렸다(다신 안할꺼다. 냄새도 심하고 힘들다). 여기까지 대략 필요한 것들과 하고싶은 것들의 구매 목록이다. 참 많다. 하지만, 더 충격적인 사실은 우리가 그렇게 많이하는 편이 아니라는 것이다. 도대체 많이 하는 사람들은 얼마를 쓰는걸까?</p>\n<p>새집에 이사할때는 대부분 대출을 끼고 구매한다. 대출 없이 집을 구매하는 사람은 거의 없다. 그렇다보니 대출할때 천만원 정도는 우습게 생각한다. 1 억을 빌리든 1 억 1 천을 빌리든 크게 개의치 않는다. 1 억 빌려도 충분히 입주 가능하지만, 여러가지를 구매하기 위해 1 천만원을 더 빌린다. 은행에서는 두팔벌려 환영이다. 이자 더 내겠다는데 말릴 필요 있을까? 그런데 막상 1 천만원을 갚으려고 하면 만만치 않다. 특히 나처럼 외벌이 직장인이라면 더더욱 힘들다. 애를 키우면서 1 년에 1 천만원을 더 갚으려면 정말 아끼고 아껴야 한다. 그런데 내집에 입주한다는 들뜬 마음 때문에 평소에는 생각하지도 않던 소비를 마음 놓고 해버린다.</p>\n<p>입주시장과 비슷한 시장이 몇가지 있다. 첫번째로 결혼시장이다. 결혼할때는 두 집안이 서로 눈치를 보느라 합리적이고 실용적인 소비가 어렵다. 어른들은 체면도 차려야 하고 자기 자식이 남의 집에서 우습게 보이길 원치 않는다. 그러다 보니 뭐 하나를 하더라도 절대 저렴하게 하지 않는다. 두번째는 아이들 관련 시장이다. 아이들이 입는 옷, 아이들의 교육, 아이들의 장난감 뭐 하나 쉽게 결정하지 않는다. 저렴하지도 않다. 특히나 요즘처럼 한 아이만 키우는 가정이 많다보니 더더욱 애지중지 키운다. 그렇다보니 부모들은 아이들에게 투자를 아끼지 않는다.</p>\n<p>입주 관련 시장은 위에서 말한 결혼과 아이들 관련 시장에 비해 결코 작은 시장이 아니다. 게다가 대출이라는 편리한 제도 때문에 사람들이 더욱 쉽게 지갑을 연다. 나중에 생각해보면 해도 그만 안해도 그만인게 대부분이지만, 이미 쉽게 열린 지갑이 닫히는 법은 없다. 특히 나처럼 처음 새 아파트에 입주하는 사람이라면 자기 집을 더 이쁘고 편하게 꾸미고 싶은 욕망이 있어 뭐라도 더 하고 싶어한다. 역시 사람은 다양한 경험을 해보는게 중요하다. 내가 새 아파트에 입주해보지 않았다면 이런 입주 시장이 클거라고는 전혀 생각지 못했을 것이다.</p>","frontmatter":{"title":"아파트 입주시장은 의외로 크다.","date":"July 31, 2018"}}},"pageContext":{"slug":"/2018/07/31/apartment_market/","previous":{"fields":{"slug":"/2018/07/27/my_watch_suunto/"},"frontmatter":{"title":"최고의 스포츠 워치, 순토(suunto)"}},"next":{"fields":{"slug":"/2018/08/08/review_move_new_apartment/"},"frontmatter":{"title":"분양 아파트 입주 후기"}}}}