{"data":{"site":{"siteMetadata":{"title":"bono's blog","author":"bono"}},"markdownRemark":{"id":"939d0d1c-e038-588c-89c8-9c6688755465","excerpt":"지난밤에 늦게 잠든 탓일까? 온 몸이 찌뿌둥하다. 언제나 최후의 1 분까지 잠을 청하는 습관 때문에 출근시간 4…","html":"<p>지난밤에 늦게 잠든 탓일까? 온 몸이 찌뿌둥하다. 언제나 최후의 1 분까지 잠을 청하는 습관 때문에 출근시간 40 분 전에야 겨우 눈을 뜬다. 새벽동안 분비된 내 체취로 꿉꿉해진 이불에서 퀘퀘한 냄새가 은근히 전해진다. 방문에 설치한 철재 안전문 넘어로 고양이의 신경질적인 울음소리가 들려온다. 밥이 없거나 물이 없거나 화장실은 안치워준 탓이겠지. 10 년 넘게 함께 살아온 녀석이지만 어렸을적의 귀여움은 사라진지 오래다. 오래된 연인같다.</p>\n<p>십수년간 거의 매일 아침은 씨리얼로 해결한다. 밥을 먹기 귀찮아서라기 보다는 우유와 과자를 좋아하기 때문에 먹는것 같다. 어느순간부터 지금껏 먹던 유전자 변형 옥수수로 만들어진 씨리얼을 그만 먹어야겠다는 생각이 들었다. 30 대 중반을 넘어서면서 하나둘 찾아오는 건강 이상 신호를 무시할 용기가 부족해서인가보다. 최근에는 독일에서 수입한 귀리 베이스의 씨리얼을 먹기 시작했다. 맛도 나쁘지 않다. 그리고 튀긴 유전자 옥수수 보다는 훨씬 건강에 좋을것 같다. 정말인지는 잘 모른다.</p>\n<p>와이프와 아이는 아직도 자고 있다. 둘 다 아침잠이 많다. 나도 아침잠이 많지만 출근을 해야하는 입장이다 보니 먼저 일어날 수 밖에 없다. 기계적으로 수염을 깎고 샤워를 한다. 대충 옷을 입고 머리를 매만진다. 예전에는 옷차림에 나름 신경을 썼지만, 이 마저도 30 대 중반에게는 사치로 느껴진다. 마지막으로 옷을 샀던게 언제였더라…</p>\n<p>불어가는 몸뚱아리에 죄의식이 느껴져 일부로 좀 걷는다. 집에서 지하철역까지 10 분, 지하철에서 내려서 회사까지 10 분, 하루에 2 번하면 총 40 분을 걷는다. 10 분에 1km 를 걷고 보폭은 90cm 정도 되니까 대충 1100 걸음이다. 40 분을 꼬박 걸으면 4400 걸음은 걷는다. 정말 건강에 도움이 되는지는 모르겠다. 아마 이정도로는 한참 부족할 것이다. 하루 평균 40Km 를 걸어서 여행했을때 한달동안 5kg 정도 살이 빠졌었는데… 어림도 없다.</p>\n<p>지금은 웹 프로그래머로 일하고 있다. 만족스러운 편이다. 무엇보다도 사람이 주는 스트레스가 거의 없다. 야근도 거의 없다. 점수로 매기면 10 점 만점에 8 점은 줄 수 있다. 대한민국 직장인의 만족도가 얼만지는 잘 모르겠지만, 아마도 8 점에 한참 못미칠거라 생각한다(3~4 점이 아닐까 추측해본다). 원래부터 프로그래머는 아니었다. 건축을 공부했고 건축에 뜻이 있었다. 현실의 벽을 넘지 못해서 그만두었다는건 핑계고 진짜 문제는 (지난 글에서 말한것 처럼) 끈기 부족이 확실하다. 서른이 되기 직전, 설계사무소를 그만두고 잠시 방황하다 컴퓨터 프로그래밍을 배우기 시작했다. 프로그래머로 자리잡는데는 꽤나 많은 난관이 있었고, 보통 이상의 노력이 필요했다. 몇번이나 그만두고 싶은 욕구가 있었지만, 잘 참아냈다. 그 결과 평범한 수준보다 약간 떨어지는 정도의 프로그래머로 잘 살아가는 중이다.</p>\n<p>끈기 부족 병이 도진건지 프로그래머로 성공하고싶은 마음이 없는건지 모르겠지만, 자꾸 딴 생각을 하게된다. 1 인 기업가로 독립해볼까? 부동산 서비스를 개발해볼까? 아니면 꾸준한 글쓰기로 작가로 데뷔해볼까? 모두 순탄하지 않은 길이다. 장담하건데 적당히 실력있는 프로그래머 되기보다는 분명 어려울 것이다. 하루에도 몇번씩 그 생각을 하면서 퇴근하는 지하철에서 책을 읽는다. 책을 읽는 중간에 간간히 프로야구 경기 결과를 확인한다. 광적인 팬은 아니지만, 어렸을때부터 좋아하던 구단이 경기에서 이기면 기분이 좋다.</p>\n<p>출근시간이 늦다보니, 퇴근시간도 늦다. 저녁 8 시는 되야 집에 도착한다. 맞다. 집도 멀다. 판교 난민의 대표적인 케이스가 바로 나다. 판교나 분당에 살기에는 돈이 없다. 적당한 가격의 집을 찾아서 아래로 아래로 내려오다 보니 여기(용인 or 수원)까지 왔다. 살아보니 여기도 나쁘지 않다.</p>\n<p>저녁은 다 같이 먹는다. 딸 아이와 사이가 좋아 식사후에는 같이 시간을 보낸다(TV 보여줄때가 더 많을지도..). 딸이 커가는 모습을 보고 있으면, 정말 행복하다고 느낀다. 몇 년 지나고 훌쩍 커버리면 나와 놀아주지도 않을거 뻔히 알지만, 그래도 너무 사랑스럽다. 11 시쯤 되야 딸 아이가 잠에 빠져든다.</p>\n<p>스스로에게 투자할 수 있는 유일한 시간이 왔다. 게임을 하거나 TV 를 시청하는걸로 시간을 보내기에는 너무 아깝다. 프로그래밍 공부를 하기도 하고, 책을 읽기도 한다. 또는 와이프와 대화하면서 맥주한잔 마실때도 있다. 좀 더 생산적인 일로 루틴을 만들고 싶지만, 체력이 발목을 잡는다. 운동을 해야하는걸까… 에라이, 모르겠다. 그냥 자야겠다.</p>","frontmatter":{"title":"나의 루틴(Routine)","date":"June 22, 2018"}}},"pageContext":{"slug":"/2018/06/22/my_routine/","previous":{"fields":{"slug":"/2018/06/21/about_my_poor_patience/"},"frontmatter":{"title":"형편없는 나의 끈기에 대하여"}},"next":{"fields":{"slug":"/2018/06/23/start_arduino/"},"frontmatter":{"title":"아두이노(arduino)를 시작해보자"}}}}