{"data":{"site":{"siteMetadata":{"title":"bono's blog","author":"bono"}},"markdownRemark":{"id":"6875809c-945c-5783-b788-ece35c5ee4e0","excerpt":"…","html":"<p>연인, 친구, 가족을 포함한 모든 관계에서 대화는 갈등을 해소하는 가장 좋은 수단입니다. 여자친구와 싸웠거나, 친구와 다퉜을 때도 감정을 배제하고 차분하게   대화를 해보면 사실 아무것도 아닌 경우가 대부분이지요. 하지만 감정에 휘둘리거나 자존심의 이유로   다툰 상대와 계속해서 대화하기를 꺼려하다가는   두 사람은   다시는 돌이킬 수 없는 관계가 될 수도 있습니다. 그만큼 대화라는 것은 인간사회의 ‘관계’에서   굉장히   중요한 부분입니다.</p>\n<p>일반적으로   우리는, 인간   사이에서 발생하는 대부분의   대화는   말이라는 음성으로   이루어지는 것이라   여깁니다.  하지만 한 연구에 따르면, 실제 인간 사이의 의사소통 과정에서 말 자체가   차지하는 비중은   약  10 퍼센트 정도밖에    안된다고 합니다. 나머지 90 퍼센트는   의사소통 과정 중에서 나타나는   말투, 억양, 행동, 태도, 상황, 몸짓, 눈빛, 뉘앙스 등이 차지하고 있습니다. 이 말은 즉, 같은 말을 해도 내가 어떤 상황에서   어떤 태도로 하느냐에 따라서 받아들이는 사람의 입장에서는 극과 극이 될 수 있다는 것입니다. 대화가   갈등을   해소하는   가장 좋은 수단이 될 수도 있지만, 반대로 관계를 해치는 가장 나쁜 수단이 될 수도 있습니다.</p>\n<p>우리 사회에서 말로 인한 문제는   이미 우리 일상에서 쉽게 찾아볼 수 있습니다.  메신저나 문자메세지가 그렇습니다. 메신저 상의 대화는 글로만 이루어져 있습니다. 컴퓨터나 스마트폰으로 전달하는 이 메세지에는 글자만 있을 뿐 말하는   사람의 감정이나 억양, 행동 등을 제대로 표현되어 있지 않습니다. 그렇다보니 받아들이는 사람의 입장에서는 전달된 메세지만 보기 때문에   전달하는 사람의 의도와 상관없이쉽게 오해를 할 수 있습니다. 아마 남성분들이라면   연인에게 이모티콘 하나 없는 건조한 메세지를   보냈다가 괜한 다툼으로 번졌던 일을 한번쯤 겪어 보셨을 것입니다.</p>\n<p><img src=\"%7B%7B%20site.baseurl%20%7D%7D/assets/cfile29.uf.1926F23A4FE1269625D396.jpg\"></p>\n<p>세상에는 말이 필요 없는 관계도   있습니다. 서로 말이 통하지 않아도 충분히 서로를 아끼고, 사랑할 줄 압니다. 말이 통하지 않는데 어떻게 서로를 이해하고 사랑하냐구요?  위에서 언급했듯   인간이 행하는 의사소통에는 말을 제외한 다른 요소들이   약 90 퍼센트를 차지하고 있기에  10 퍼센트밖에 차지하고 있지 않은 ‘말’이 없다고 해서 서로를 사랑하지 못한다는 것은 말도 안되는 얘기입니다.</p>\n<p>우리 삶은 너무나도   크게 말에 의존하고 있습니다. 스마트폰이 보급되면서 그 의존도는 더 커졌지요. 만나서 얼굴을 마주하고 얘기하는 것 보다 스마트폰의 자판을 누르며 건조한 말(?)을   주고 받는 것이 더 편한 세상입니다. 심지어는 바로 옆자리에 앉은 사람과도 메신저로 말을 주고 받지요.  대화는 말을 주고 받는   단순한 것이 아닙니다. 대화는 상대방을 마주하고   눈과 표정을 보면서   마음을 주고 받는 행위입니다. 상대방이 하는 말이 중요한 것이 아니라 상대가 어떤 마음으로 이 말을 하는가가 더 중요한 것입니다.</p>\n<p>컴퓨터와 스마트폰의 발달이 우리의 삶을 훨씬 편하게 만들어 준 것은 부정할 수 없는   사실입니다. 하지만   가끔은누군가와 키보드나 스마트폰이 아닌 눈으로, 건조한 메세지가   아닌 마음으로   대화를 나누어 보는 것이 어떨까요?</p>","frontmatter":{"title":"대화가 필요해(?)","date":"May 09, 2012"}}},"pageContext":{"slug":"/need-conversation/","previous":{"fields":{"slug":"/presentaional-component-container-component/"},"frontmatter":{"title":"[번역] 프레젠테이션 컴포넌트와 컨테이너 컴포넌트"}},"next":{"fields":{"slug":"/think-about-my-writing/"},"frontmatter":{"title":""}}}}