{"data":{"site":{"siteMetadata":{"title":"bono's blog","author":"bono"}},"markdownRemark":{"id":"5dffea2f-20e6-5738-a02d-56e79599a032","excerpt":"…","html":"<p>나는 종교가 없다. 부모님도 종교가 없다. 학교 다닐때 작성하는 생활기록부에 종교란은 항상 ‘무교’라고 적어냈다. 그리고 성인이 되어서도 특별히 종교를 가지겠다는 생각을 해본적도 없다. 종교를 가진적이 없다보니, 종교를 가진 삶을 상상하기는 어렵다. 친한친구 중에 독실한 기독교인이 있지만, 그저 타인의 시선일 뿐이다. 그렇기 때문에 그 친구를 오랫동안 잘 관찰하더라도 진실하게 종교를 가진 삶을 느낄수는 없을 것이다. 종교는 보통 신 또는 신의 대리자가 있고, 그들의 따르는 신자가 있다. 신자들은 종교의 가르침을 믿고 따른다. 그럼으로써 자신과 그들 사이에 연결고리가 만들어진다고 느낀다. 이 연결고리는 그 어떤 도구로 만들어지는게 아니고 신자들의 믿음으로 형성된다. 믿음은 지극히 주관적이기 때문에 아무리 타인이 오랫동안 관찰한다 해도 제대로 이해할 수는 없다.</p>\n<p>그렇다면 행복은 무엇일까? 행복은 판단하는 주체가 누구냐에 따라 다르지만(가령, 생물학자에게 행복은 세르토닌과 도파민의 수치가 올라감을 의미한다), 보통 개인의 기대에 따른 만족감을 의미한다. 개인의 기대치가 높다면 기대만큼 성과가 없을때 우울할것이고 기대치가 낮으면 조그만한 성과에도 행복해할 가능성이 높다. 나는 연봉 2 억을 받고 싶은데 고작 1 억밖에 안된다면 우울할 것이고, 연봉이 5000 만원이면 충분한데 6000 만원을 받으면 행복하다 느낀다. 또한 삶의 의미를 가진 사람이 그렇지 않은 사람에 비해서 행복하다. 삶에 의미가 있다면 어떤 어려움이 닥쳐도 극복해낸다. 예를 들어 아이가 있는 부모는 아이를 위해서 무슨일이든 할 수 있다. 이 부모에게 삶의 의미는 바로 아이다. 반대로 삶의 의미가 없는 사람은 무슨일을 하더라도 별로 감흥이 없다. 내가 지금하는 이 일을 반드시 완수하고 꾸준히 이어나가야할 이유를 찾지 못하는 것이다. 그래서 이런 사람들은 미래를 생각하지 않고 현재의 쾌락만 쫓을 가능성이 높다.</p>\n<p>종교를 가진 사람들에게 종교는 하나의 삶의 의미다. 내가 믿고 따르는 신과 신의 대리자의 가르침을 따르고 종교의 교리를 따라 사는 삶에 의미가 있다고 여긴다. 삶에 의미가 있으니 삶을 대하는 태도가 다르다. 종교의 가르침대로 자신의 분야에서 최선을 다하고 가족과 주변 사람들에게 최선을 다한다. 그래서 종교를 가진 사람들이 대체로 성실하고 긍정적이다. 그리고 타인을 대할때도 종교가 없는 사람들보다는 훨씬 부드러웠다(본심이 아니라 하더라도 표면상으로). 적어도 내가 만나본 진실된 종교인들을 정말 그러했다.</p>\n<p>그렇다면 행복해지기 위해 종교를 가져야만 하는걸까? 삶의 의미를 찾기 힘든 사람에게는 손쉬운 선택지가 될 수 있다. 하지만, 종교가 모든것을 해결해주는 만능열쇠는 아니다. 그리고 믿음이라는게 선택만 한다고 만들어지는 것도 아니다. 믿음없이 단지 목적만을 위해 종교를 선택한다면 아마도 그 사람은 종교라는 삶의 의미를 얻지 못할 가능성이 높다.</p>\n<p>내가 생각하는 행복해지기 위한 가장 좋은 방법은 자기성찰이다. 내가 좋아하는것은 무엇이고, 내가 원하는 미래는 어떤것이며 어떤한 방식으로 살아가고 싶은지 끊임없이 고민하고 나 자신과 대화해야한다. 이때 명상이나 글쓰기가 훌륭한 도구가 된다. 그리고, 내 감정과 나를 동일시하지 않고 분리하는 연습도 필요하다. 많은 사람들이 내 감정이 바로 나라고 착각한다. 하지만, 감정이라는것은 일시적이기 때문에 진정한 나 자신이 될 수 없다. 그래서 화, 성적 쾌락 등의 불필요한 감정 표출을 줄이는 연습이 필요하다. 지속적인 자기성찰은 고통이 따른다. 반복해야하고, 꾸준해야한다. 그리고 절제가 필요하다. 행복해지기 위해 이런 고통을 견뎌내야 한다는게 아이러니하게 들릴지도 모르겠다. 하지만 이 모든것은 참다운 나와 내 삶의 의미를 찾아가기 위한 과정이다.</p>","frontmatter":{"title":"종교를 가진 사람이 더 행복한 이유","date":"August 10, 2018"}}},"pageContext":{"slug":"/2018/08/10/relationship_between_religion_and_happiness/","previous":{"fields":{"slug":"/2018/08/08/review_move_new_apartment/"},"frontmatter":{"title":"분양 아파트 입주 후기"}},"next":{"fields":{"slug":"/2018/08/13/raise_plant/"},"frontmatter":{"title":"식물을 키워보자"}}}}