{"data":{"site":{"siteMetadata":{"title":"bono's blog","author":"bono"}},"markdownRemark":{"id":"ed3c6cd9-2005-5148-bf9c-fd34d444108d","excerpt":"블로그 글도 몇 개 되지 않지만 블로그를 거의 내버려둔 시간이 오래되었습니다. 심지어 티스토리 로그인이…","html":"<p>블로그 글도 몇 개 되지 않지만 블로그를 거의 내버려둔 시간이 오래되었습니다. 심지어 티스토리 로그인이 3 개월이 넘어서 휴면 계정을 해제 하라고 하더군요. 처음 블로그를 시작할 때는 특정 주제에 대해(주로 환경과 관련된) 어느정도의 길이의 완성된 글을 쓰겠다는 생각이었습니다만, 글을 쓰는게 익숙하지 않은 상태의 사람이 갑자기 완성된 형태의 글을 쓴다는 것은 많은 시간의 할애가 필요한 일이더군요. 자료의 수집에서 시작해서 모은 자료를 정리하고 정리된 자료를 통해서 주제를 선정하고 거기에 내 의견을 더하여 글을 쓰고 두어번 퇴고의 과정을 거치다보면 대충 3~4 시간이 소요 되더군요. 제가 그렇게 부지런한 성격도 아니고 하루에 3~4 시간을 글쓰는데 투자하는 것은 쉽지 않은 일이었습니다. 그러다보니 하루에 하나를 쓰겠다는 의지는 일주일에 세개, 두개가 되고 이런일 저런일이 있다보면 자연스럽게 글을 쓰는것을 멀리하게 되더군요.</p>\n<p>왜 그럴까 생각해보았습니다. 생각하다보니 몇가지 이유가 떠오르더군요.</p>\n<p>1. 너무 전문적인 주제로 글을 쓰려는 생각</p>\n<p>2. 완성된 글을 쓰겠다는 생각</p>\n<p>3. 글을 길게 써야 한다는 것에 대한 집착</p>\n<p>대충 위의 세가지로 요약되는 것 같습니다. 우선 공통적으로 위의 세가지는 모두 블로그의 성격과 목적 때문에 발생한 문제입니다. 기본적으로 블로그는 혼자서 보고 기록하는 매체가 아니라 남들에게 자신의 생각을 보여주기 위한 공간입니다. 이러한 역학관계가 기본전제가 되기 때문에 가벼운 주제로 뒤죽박죽인 글을 쓰는게 쉽지 않은 것이지요.</p>\n<p>첫번 째, 전문적인 주제에 대한 집착의 문제는 결국 위에서 언급한 공통적인 문제와 유사합니다. 내가 평소에 어떤생각을 가지고 있고 어떤 분야에 관심이 있는지를 쓰기보다는 남들이 내가 쓴 글을 보고 어떻게 생각할까가 더 중요했던 것이지요. 나 이런사람이다. 대단하지 않느냐? 이런식으로요. 결과적으로 대단히 관심도 없는 분야에 대해서 공부하고 자료를 수집하고 정리하는 과정이 괜히 글쓰는 시간만 더 길게 만든 것입니다.</p>\n<p>두번 째, 완성된 글을 쓰겠다는 생각입니다. 이유는 다를게 없습니다. 누군가에게 내가 쓴 문장과 문맥, 표현 등을 보여줘야 하기 때문에 최대한 잘 쓰려고 하다보니 여러차례 퇴고과정을 거치게 되고 이 역시 글 쓰는 시간을 늘리는데 한몫하게 되었습니다.</p>\n<p>사실 위의 두 가지 사항은 글을 쓰는 것을 멀리하게 되는 이유이긴 하지만, 어떤 주제를 가지고 완성된 글을 만들어가는 것은 여전히 필요한 부분입니다. 세번째로 언급한 글을 길게 쓰는 것에 대한 집착은 조금은 다시 생각할 필요가 있을 것 같습니다. 글을 쓰는 주제에 따라 길게 쓸 필요가 있기도 하지만 가벼운 주제로 간단하게 글을 쓰고 싶은데 길게 써야한다는 압박감에 억지로 문장을 늘리고 사족을 덧붙이는 경우가 많았던 것 같습니다. 때로는 가볍고 짧막하게 쓰는 글이 읽는 이의 입장에서는 더욱 편하게 느껴질지도 모르지요.</p>\n<p>이제는 좀더 가벼운 주제로 아무렇게나 한번 써볼까 합니다. 그래서 남들에게 보여주기 부끄러워 에버노트에 끄적여 놓았던 몇가지 글들도 블로그로 옮겨놓으려구요. 아무튼 블로그 다시 한번 살려보지요.</p>","frontmatter":{"title":"글을 써야 한다는 것의 집착","date":"January 03, 2014"}}},"pageContext":{"slug":"/think-about-my-writing/","previous":{"fields":{"slug":"/shaping-memories/"},"frontmatter":{"title":"기억(추억)의 형상화"}},"next":{"fields":{"slug":"/from-architect-to-progammer-1/"},"frontmatter":{"title":"건축에서 프로그래머로(1) - 건축에 뜻을 두다"}}}}