{"data":{"site":{"siteMetadata":{"title":"bono's blog","author":"bono"}},"markdownRemark":{"id":"b4ba6d02-3550-5483-b811-3aa43439b1cb","excerpt":"…","html":"<p>나는 왜 건축을 그만두었는가? 지금의 나는 이 질문에 대해 완전하게 답하지 못한채로 있습니다. 지금은 완전히 관심밖의 일처럼 자물쇠 달린   오래된 상자안에 방치해둔채 새로운 것에 대한 생각으로 가득차있지요.  건축 경기가 어려워서라던지, 한국에서 건축가라는 직업에 대한 가치를 매우 낮게 평가한다던가 하는 것은 현실에 대한 핑계에 불가하다 생각합니다. 건축을 그만둔 후 몇년간(지금까지), 누군가 저에게 왜 건축을 그만두고 지금의 길을 걷고 있냐고 물어보면 백이면 백 위와 같이 대답하곤 했습니다. 정말 이런 현실이 문제인걸까요?</p>\n<p>왜 건축을 그만두었는가를 다시 생각해보기 전에, 제가 건축을 공부하면서 느낀 건축이라는 학문에 대해서 잠깐 얘기해보겠습니다. 건축을 이를 때 좋은 말들이 많이 있습니다. ‘건축은 사회를 비추는 거울이다’, ‘건축은 종합예술이다’, ‘건축은 자신의 철학이 필요하다’ 등등 건축에 대한 정의는(주로 건축학과 에 다니는 학생들의 정의) 굉장히 철학적이고 사회적이며 심지어는 예술적이기까지 합니다. 이런 정의를 진리라고 받아들이는 건축과 학생들은(혹은 이런 정의를 증명하기 위해서는) 광범위한 지식의 습득과정이 필요합니다. 단순히 미적감각을 키우거나 그림을 잘그려서는 안되고, 시대의 흐름에 대해 뒤쳐지면 안되며, 사람과 공간에 대한 개념과 이들의 관계를 미적 또는 형태적으로 표현할 수 있어야 합니다. 그리고 그 표현을 위한 철학적 접근도 필요하지요. 굳이 철학이 아니더라도 공간에 스토리텔링이 필요한 경우도 있으며, 시적으로 공간을 접근할 수도 있습니다. 그것도 모자란건지 아니면 새로운 이론을 만들려는 건지는 잘 모르겠지만, 최근 건축계는 모든 학문과 이종교배를 시도하고 끊임없이 새로운 시도로 추구 합니다. 이 모든 것들이 쌓이고 쌓여서 종합적이고 사회적인 철학 예술이 만들어지는 것입니다.</p>\n<p>정말 위에서 말한 건축이 진짜 건축일까요? 저는 고작 1 년 동안만 건축 사무소에서 밤낮없이 일해봤습니다. 그렇기 때문에 섣불리 판단할 수는 없습니다만, 건축의 실체는 의외로 간단할지도 모릅니다. ‘사람들이 원하는 공간을 만든다’ 라고 할수 있을까요? 좀 더 현실적으로 말하자면 ‘건축주가 원하는 공간을 만든다’라고 할 수 있겠습니다. 건축주라는 사람 또는 회사가 원하는 건축물을 만드는 것이 건축이라면 결국 건축주가 누구냐는 것이 가장 중요한 요소가 되겠지요. 아무리 뛰어난 건축가라도 결국은 건축주가 건축의 대부분을 결정하기 때문이지요. 여기서 건축가의 역할이란 단지 건축주가 원하는 건물을 넓고 멋지게(?) 짓는 사람 아닐까요. 물론 건축가 스스로가   건축주의 요구를 받아들이는 수준 안에서 자신의 건축관을 표현할 수는 있습니다. 이런 현실에서 많은 사람들이 원하는 공간을 만드는데는 한계가 있을 수 밖에 없겠습니다. 결국 문제는 돈이 아닐까 생각합니다.</p>\n<p>또 한가지 이유를 들어 볼까요? 건축은 굉장히 보수적입니다. 아직도 르꼬르뷔제의 건축의 5 원칙에서 거의 벗어나지 못했습니다. 이 5 가지 원칙을 벗어난것 처럼 보이는 디지털 아키텍트의 그래픽 작업들은 현실적으로 실현불가능해 보이는 것이 대부분이기 때문에 이 작업들을 건축이라 부르기도 조금 애매합니다. 저는 공간적으로 또는 형태적으로 이 원칙을 벗어나는 것이 미래의 건축이라고 생각하지는 않습니다. 오히려 현재의 상황에서는 오히려 얼마나 지속가능한지(환경을 고려한다던가 건축의 수명이 길다던가) 그리고 얼마나 첨단화되는지가 더 중요해 보입니다. 자원은 한정되어 있고 쓰레기는 넘쳐나기 때문에 이 문제를 조금이나마 덜 야기할 수 있다면 그것은 분명 훌륭한 건축이 될 수 있겠지요. 또 공간의 질을 높이는 것도 공간의 구성이나 동선 등 전통적인 건축 요소뿐 아니라 IT 분야와의 접목이 더욱 중요해질 것입니다. 유비쿼터스라던가, 인터랙티브 공간이라든가, 생활패턴에 의한 공간변화와 같은 반응형 공간이 이러한 예가 되겠습니다. 하지만 건축학과의 교육 커리큘럼을 살펴보면 지금이나 10 년전이나 전혀 달라진 것이 없습니다. 여전히 설계수업, 구조수업, 의장수업, 설비수업, 재료수업 정도로 나뉘어 있습니다. 환경수업이 있긴 하지만 결로나 태양광 같은 자연적인 것에 한정되어 있고 미래의 환경에 대한 고민은 전혀 없습니다. IT 쪽은 더욱 열악하지요. 수업이 전혀 없습니다. 건축과에서 코딩수업을 하라는 말은 아닙니다. 그저 공간의 질을 높이기 위해서 어떤 기술을 접목할 수 있는지에 대한 수업은 필요하겠습니다.</p>\n<p>종합해보면, 돈이 우선일수 밖에 없는 현실, 이론이나 교육과 실제 건축의 괴리, 변화없는 보수적인 학문이라는 이유로 요약될 수 있겠는데요. 이런 이유로 건축을 그만둔게 맞을까요? 여전히 잘 모르겠습니다.</p>","frontmatter":{"title":"나는 왜 건축을 그만두었는가?","date":"April 16, 2014"}}},"pageContext":{"slug":"/why-did-i-quit-a-job-in-architecture/","previous":{"fields":{"slug":"/presentaional-component-container-component/"},"frontmatter":{"title":"[번역] 프레젠테이션 컴포넌트와 컨테이너 컴포넌트"}},"next":null}}