{"data":{"site":{"siteMetadata":{"title":"bono's blog","author":"bono"}},"markdownRemark":{"id":"1114ef8f-9308-5643-8377-e24aefb57af4","excerpt":"히가시노 게이고의 두 번째 책을 읽었다. 몰랐는데, 전에 읽었던 <백마산장 살인사건>은 히가시노 게이고의 초기작에 속한다. 데뷔 이후에 3 번째로 쓰여진 작품이다. 작가마다 다르지만 보통…","html":"<p>히가시노 게이고의 두 번째 책을 읽었다. 몰랐는데, 전에 읽었던 &#x3C;백마산장 살인사건>은 히가시노 게이고의 초기작에 속한다. 데뷔 이후에 3 번째로 쓰여진 작품이다. 작가마다 다르지만 보통 3 번째 쓰여진 책을 초기작이라하지 않는다. 하지만, 히가시노 게이고가 워낙에 다작하는 작가라 수십권의 작품을 쓴 그에게 3 번째 책은 완전히 초기작이라 할 수 있다. 연도를 살펴보면 데뷔하고 1 년만에 쓰여졌다. 나는 &#x3C;백마산장 살인사건>이 이렇게 오래된 책인지 몰랐다. 그래서 이 책을 읽고 그의 명성에 비해서 재미는 떨어진다 생각했다. 조금만 더 관심을 기울여 인기작과 초기작, 최신작을 구분해서 읽었어야 했다. 그랬으면 지난번처럼 쉽게 혹평을 내리지는 않았을거다. 히가시노 게이고 작가에게 사과의 말을 전해야 할 것 같다.</p>\n<p>두 번째 읽은 책은 &#x3C;11 문자 살인사건>이다. 이 또한 제목에 이끌려 선택했다. 그런데, 공교롭게도 두 번째 선택한 이 책 또한 히가시노 게이고의 대표적인 초기작이다. 이번에는 5 번째 작품이다. 그래서인지 몰라도 결론부터 말하잠면, 그다지 재미없었다. 빠른 전개 때문에 지난번 책과 마찬가지로 흡인력 하나는 인정할만하다. 하지만, 내가 왜 재미없다고 느꼈을까? 우선 간단한 줄거리를 살펴보자. 생각나는대로 적어보았다(스포일러가 될만한 부분은 제거하였다).</p>\n<p>어느날 같이 술을 마시던 남자친구가 이렇게 말한다. “누군가 날 죽이려는것 같아” 하지만 자세한 얘기는 해주지 않는다. 그리고 얼마뒤 그가 말한것처럼 진짜 죽어버린다. 누군가에게 살해당한 것이다. 추리작가인 주인공은 남자친구의 죽음에 의문을 품고 자신의 담당 편집자이자 친구인 후유코와 함께 개인적으로 수사를 시작한다. 끈질긴 추적 끝에 남자친구의 죽음이 1 년 전 요트 여행에서의 사고와 관련이 있다는 사실을 알아낸다. 1 년 전의 요트 사고에서는 남자 1 명이 죽었고, 나머지는 모두 구출되었다. 주인공의 남자친구는 그 때 구출된 사람중의 한명이었다. 사건은 여기서 끝이 아니었다. 진실에 가까워지면 가까워질수록 당시 구출된 사람들이 하나씩 살해되어간다. 다급해진 주인공은 구출된 사람들에게 그 날의 진실을 말해달라고 요청하지만, 사람들은 하나같이 그녀의 요청을 거절한다(또는 거짓말한다). 앞을 보지 못하는 사장의 딸만이 그녀에게 넌지시 진실을 말해준다. 하지만, 앞을 보지 못하는 아이기 때문에 사건을 해결하기 위한 결정적 실마리는 얻지 못한다. 사건이 점점 미궁에 빠지던 찰나 작년의 요트 여행을 주최했던 야마모토 사장이 올해도 그때와 똑같이 요트여행을 계획한다. 주인공과 그의 친구 후유코를 여행에 초대하고 Y 섬으로 향한다. 이 섬은 저주 받은 것일까? 아니면 누군가 계획한 것일까? 작년처럼 이번에도 한사람이 죽는다. 모두들 자살이라고 생각하지만, 주인공은 그렇게 생각하지 않는다. 여행을 마치고 돌아온 주인공은 1 년전 요트 여행에서 죽은 남자의 집에서 결정적인 증거를 발견하고 결국 사건의 전말을 알게된다.</p>\n<p>추리 소설의 묘미는 범행 현장과 주변 사람들의 행동을 통해 진짜 범인을 유추하는데 있다. 독자들은 사건의 단서들로 범인을 추측하고 맞추는데서 짜릿함을 느낀다. 하지만, &#x3C;11 문자 살인사건>에는 범인을 유추하기 위한 단서가 부족하다. 사건은 일어나지만, 사건을 통해 얻을 수 있는 힌트는 빈약하다. 빠르게 전개되는 이야기에는 몰입이 잘 되지만, 추리소설을 읽는 독자들에게는 그것만으로는 부족하다. 그리고 또하나 결정적인 단점은 이 책의 제목이다. 책 어디에도 살인사건과 11 문자의 관계를 설명하지 않는다. 다만, 책의 마지막 부분에서 범인이 살인 할 때마다 11 글자로 메세지를 보낸다는게 전부다. 책 제목으로 쓸 정도의 인과관계는 전혀 보이지 않는다. 11 문자가 아니라 12 문자나 20 문자라해도 크게 달라지는 부분이 없다. 다소 아쉬운 부분이다. 책 제목을 &#x3C;11 문자 살인사건>이라고 쓰기 위해서는 11 문자와 사인사건의 관계가 명확해야한다. 11 문자가 아니면 안되는 이유가 반드시 있어야 한다.</p>","frontmatter":{"title":"도대체 11문자가 뭐야? <11문자 살인사건 : 히가시노 게이고>","date":"August 18, 2018"}}},"pageContext":{"slug":"/2018/08/18/11_text/","previous":{"fields":{"slug":"/2018/08/17/relationship_between_work_and_turnover/"},"frontmatter":{"title":"이직률이 낮은 회사는 좋은 회사일까?"}},"next":{"fields":{"slug":"/2018/08/21/2018_mirun_seoul/"},"frontmatter":{"title":"목표를 잡았다 (feat. 2018 아디다스 마이런 서울)"}}}}