{"data":{"site":{"siteMetadata":{"title":"bono's blog","author":"bono"}},"markdownRemark":{"id":"241a8f26-2dff-5522-88a7-f80c4bea7050","excerpt":"…","html":"<p>외모와 글쓰기가 반비례할리 없다. 외모가 출중한 사람이라고 글쓰기에 관심없다 말할 수 없고 외모가 뒤떨어진다 해서 반드시 글쓰기에 관심을 두진 않는다. 기생충학자로 유명한 서민 교수는 책에서 대놓고 얘기한다. 나는 못생겼다고… 표지에 나온 그의 얼굴이 특출나게 못생겼다고 생각하진 않는다. 외모가 절대적인 기준이 있는 것은 아니다. 내가 잘생겼다 혹은 못생겼다고 판단하는 기준의 오할 이상은 본인에게 달려있다고 생각한다. 얼굴이 작고 눈이 크고 입이 시원하고 콧날이 오똑한 사람이 잘생김(혹은 이쁨)의 척도라고 말할 수도 있다. 하지만 각각의 요소들이 훌륭하더라도 합쳐놓고 보면 영 어울리지 않는 사람도 많다.</p>\n<p>외모 콤플렉스가 심했던 서민 교수는 얼굴에 자신이 없으니 거의 말을 하지 않았고, 말을 하지 않게되니 자연스레 말도 못했다. 말을 잘 못하니 매사에 자신이 없었고, 자신이 없으니 뭐하나 특출나게 잘하는것도 없었다. 하지만, 자기가 처한 상황에 좌절하지 않았다. 스스로 방법을 찾아냈다. 바로 글쓰기다. 글쓰기는 그에게 무기였다. 대학교 신입생때 글을 너무 쓰고 싶어서 동아리 회지를 책임지는 편집부장이 되었다. 원래는 선배들에게 글을 받아 모아서 만드는 일을 해야하는 직책이었다. 하지만, 안그래도 글쓰기에 관심없는 의대생 선배들은 글을 내놓으라고 독촉하는 그를 피하기 일쑤였다. 그러다보니 정해진 개수의 글을 확보하지 못하는 빈도가 늘어났다. 회지에 빈 영역이 늘어났고, 결국 상당수의 글을 서민 본인이 작성하게되었다. 좋아하는 여자에게 마음을 얻기 위해서는 편지를 썼다. 말은 잘하지 못했지만, 그의 글은 여자들의 마음을 움직이기에 충분했다.</p>\n<p>나도 어렸을적 말 잘하는 아이는 아니었다. 심한 축농증을 앓았고, 숨쉬기가 답답해 곤란할때도 많았다. 항상 코가 막혀 있으니 말할때도 콧소리가 났다. 말하는 자신은 잘 몰랐지만, 친구들이 코맹맹이 소리한다고 놀려대면 주눅들곤했다. 그러다보니 말하는 횟수도 점점 줄었다. 사람들 앞에서 발표하는건 정말 끔찍하게 싫어했다. 선생님이 발표를 시켜도 최대한 안하려 했고, 꼭 필요한 말이 아니면 결코 하는 법이 없었다. 말을 많이 하던 아이가 아니다보니 성인이 되어서도 말을 잘하는 편에 속하지는 않는다. 예전에 비해 그럭저럭 나아지긴 했지만, 여전히 말하다보면 횡설수설 할 때가 많다. 글쓰기에 관심을 가지게 된 것(아직은 관심만..)이 결코 우연은 아닌듯 하다.</p>\n<p>서민교수의 외모 콤플렉스와 나의 축농증은 닮았다. 자신감을 떨어뜨렸고, 말을 안하게 만들었다. 말이 줄어들었고 이를 극복하기 위한 무기로 글쓰기를 선택했다(나는 이제 선택하려고 한다). 꼭 외모나 축농중이 아니어도 좋다. 소심한 성격탓에 남들 앞에서 제대로 말하기 힘든 사람도 마찬가지고 키가 작아서 주눅이 든 사람도 마찬가지다. 힘들고 어려운 일이 있을때 이를 극복하는 것이 가장 좋은 해결책이지만(불가능한 경우도 많다), 이를 정면으로 부딪혀 이겨내는 것이 쉬운 일은 아니다. 오히려 차선책을 찾아보는 것이 나을때도 있다. 그런면에서 글쓰기는 훌륭한 차선책이다. 다른 사람을 신경쓸 필요가 없다. 오로지 나와 종이, 펜 또는 노트북만 있으면 된다.</p>","frontmatter":{"title":"외모와 글쓰기는 반비례 하는가? <서민적 글쓰기>","date":"June 27, 2018"}}},"pageContext":{"slug":"/2018/06/27/look_and_writing/","previous":{"fields":{"slug":"/2018/06/26/write_easy/"},"frontmatter":{"title":"글, 소통을 위한 도구. 쉽게 쉽게 쓰자"}},"next":{"fields":{"slug":"/2018/06/28/need_air_conditioner/"},"frontmatter":{"title":"에어컨을 설치할까? 한달을 참을까? 아니면??"}}}}