{"data":{"site":{"siteMetadata":{"title":"bono's blog","author":"bono"}},"markdownRemark":{"id":"fdef21ba-8890-5f0e-ac14-c109cab06895","excerpt":"…","html":"<p>내겐 읽기 힘든 종류의 책이 있다. 예를 들면, 재레드 다이아몬드의 &#x3C;총,균,쇠>, 리처드 도킨스의 &#x3C;이기적 유전자>나 &#x3C;만들어진 신>, 칼 세이건의 &#x3C;코스모스> 등이 있다. 네가지 책 모두 스터디 셀러로 꾸준히 사랑받고 있다. 특히 코스모스는 발간된지 거의 40 년(1980 년 출간)이 다 되가지만 여전히 많은 이들에게 읽히고 있다. 이 책들의 종류를 굳이 따지자면 과학교양서다. 그렇다고 단순한 과학 교양서는 아니다. 역사를 바라보는 시각이나, 사회 비판적인 시선, 또는 사회 현상을 바라보는 새로운 시각이 담겨있다. 그런데 나는 이런 종류의 책이 힘들다. 네 가지 책 중에 완독한건 &#x3C;이기적 유전자> 밖에 없다. 읽을때도 꽤나 힘들었다. 그래서인지 몰라도 기억나는 내용도 거의 없고 전체적인 내용도 제대로 파악하지 못했다. 과학책이기 때문일지도 모르지만, 어쨌든 교양서기 때문에 전문가 수준의 사전 지식을 요구하는 것도 아니다. 관련된 상식만 충분히 인지하고 있으면 충분히 읽을 수 있는 수준이다. 그래서 언제가 됐든 &#x3C;이기적 유전자>도 다시 읽어볼 생각이다.</p>\n<p>그렇다면 왜 이런 책을 읽기 힘들어 할까? 몇가지 이유를 생각해보면 다음과 같다.</p>\n<p>첫째, 과학(또는 역사) 분야의 책이라 생소한 개념이 많다. 아무리 기본적인 상식만으로 읽을 수 있더라도 생소한 개념이 없을수는 없다. 책을 읽을때 단어의 뜻이나 개념을 모르면 흐름이 끊기기 때문에 전체적인 맥락을 이해하는데 방해가 될 수 있다.</p>\n<p>두번째, 두께가 문제다. 모든 과학 교양서가 두꺼운것은 아니다. 하지만 내가 언급한 책들은 500~700 페이지 정도 되는 분량이다. 쉽게 읽히지 않는 점을 감안하면 꽤 부담스러운 분량임에 틀림없다.</p>\n<p>세번째, 읽는 속도가 느리다. 아무래도 쉽게 읽히지 않는 분야의 책이기 때문에 빠르게 읽기는 힘들다. 또한 첫번째 이유처럼 생소한 개념이 나올때마다 흐름이 끊겨 더욱 책 읽는 속도가 느려진다. 또한 꽤나 두꺼운 편이기 때문에 더더욱 속도가 느려질 수 밖에 없다.</p>\n<p>&#x3C;사피엔스>도 위에 언급한 책과 비슷한 부류에 속한다. 두껍고(636 쪽) 어려운 개념이 많이 등장한다. 완독하는데 거의 3 주가 걸렸다. 거의 매일매일 읽었는데 이렇게나 오래 걸렸다. 책이 두꺼운것도 사실이고, 어려운 개념이 나오는 것도 사실이다. 하지만, &#x3C;이기전 유전자>와 비교했을때 훨씬 더 쉬웠다. 아무래도 과학 기반의 책이 아니라 역사 기반의 책이라서 그런것 같다. 번역도 한 몫 한다. &#x3C;사피엔스>는 번역이 매우 잘된 책에 속한다. 이런 종류의 책을 번역할때는 역자의 역량이 특히 중요하다. 책 내용을 완전히 파악하지 못한 역자가 번역한 책은 정말 읽기 어렵다. 본인도 이해 못하는데, 그 글을 읽는 사람은 오죽하겠는가.</p>\n<p>이스라엘 출신의 역사가 유발 하라리가 집필한 &#x3C;사피엔스>는 엄밀히 따지면 역사책에 속한다. 하지만, 동시에 과학책이기도 하고 사회과학 책이라고 해도 무방하다. 간단하게 내용을 언급하자면, 인류(사피엔스)가 지구의 지배자가 될 수 있었던 이유부터 시작해서 경제, 종교, 정치 등 인류가 만들어 낸 모든 발명에 대한 통찰을 보여준다. 농업혁명이 왜 인류를 더 빈곤하게 만들었는지, 공산주의가 왜 실패했으며 자본주의가 그 자리를 대체할 수 있었던 이유라던지, 다양한 정치 체제의 성공과 실패를 반복하면서 어떻게 민주주의에 도달했는지 등 현대의 모든 이데올로기(또는 종교)의 완성 과정을 인류의 역사를 통해 깨닫게 해준다. 읽으면서 매순간 감탄사가 터져 나왔다. 이런책은 정말 오랜만이다. 전자책으로 읽었지만 소장해두고 오랫동안 읽고 싶은 정도로 훌륭한 책이다.</p>","frontmatter":{"title":"내겐 읽기 힘든 책 <사피엔스>","date":"August 22, 2018"}}},"pageContext":{"slug":"/2018/08/22/sapiens/","previous":{"fields":{"slug":"/2018/08/21/2018_mirun_seoul/"},"frontmatter":{"title":"목표를 잡았다 (feat. 2018 아디다스 마이런 서울)"}},"next":{"fields":{"slug":"/2018/08/26/best_of_keigo_higashino/"},"frontmatter":{"title":"히가시노 게이고의 최신작 중 하나를 골라보았다 <눈보라 체이스 : 히가시노 게이고>"}}}}