{"data":{"site":{"siteMetadata":{"title":"bono's blog","author":"bono"}},"markdownRemark":{"id":"73b7de44-87ab-5e4a-bdf9-ca069db4e4b0","excerpt":"- — layout: post comments: true title: 사회적 기업의 역할 (2011/4/29) date: 2014-03-20 11:39:00.000000000 +09:00 type: post published: true status…","html":"<p>-— layout: post comments: true title: 사회적 기업의 역할 (2011/4/29) date: 2014-03-20 11:39:00.000000000 +09:00 type: post published: true status: publish categories: - THOUGHT tags: - 박원순 - 사회적 기업 - 올리버 meta: _edit_last: ‘1’ _thumbnail_id: ‘480’ _wpas_done_all: ‘1’ _aioseop_keywords: 사회적기업, 박원순 _aioseop_title: 사회적 기업의 역할 dsq_thread_id: ‘2971997324’ author: login: blueshw email: blueshw83@gmail.com display_name: blueshw first_name: ” last_name: ” ---</p>\n<p>한국사회에서는 ‘3불 타령’이라는 말이 있습니다. 어떤 새로운 일을 하려고 하면 ‘규정에 맞지않다’, ‘선례가 없다’, ‘예산이 없다’ 라는 것입니다. 이와같은 말을 가장 많이 하는 곳이 아마도 공무원들이 일하는 관공서일 것입니다. 실제로 제가 공무원과 그렇게 많은 일을 같이 해보지는 않았지만 그들은 어떤 새로운 일에 대해서 책임지는것을 꺼리는 경향이 있습니다. 무슨 일을 하려고 하면 항상 규정을 따지고 새로운 것에 대한 거부감으로 충만해 있으며 예산은 충분한데 정말 필요한 곳에 쓰려고 하면 예산이 없다고 합니다.</p>\n<p>한국사회에서는 이와관련된 또 하나의 이상한 현상이 있습니다. 그 어느나라보다 공무원이 되고자 하는 청년들이 많아 공무원시험에 합격하기가 하늘의 별따기 만큼이나 어렵습니다. 보통 몇십대일의 경쟁률은 기본인것 같습니다. 그렇다보니 ‘공무원을 준비하는 사람’이라는 실업자들도 많은 상태이지요. 이런 현상이 존재하는 가장 큰 이유는 공무원을 소위말하는 ‘철밥통’이라 부르며 일종의 평생직장이라 생각하기 때문입니다. 공무원 시험에 어렵게 붙었는데 자칫잘못해서 어떤일에 책임을 졌다가 문제가 생기길 바라는 공무원은 없을것입니다. 그래서 공무원들은 자신의 자리에서 어떤 일에대해 책임지기를 꺼려하는 것은 어쩌면 당연한 현상이라 할 수도 있겠네요.</p>\n<p>요즘 한국사회는 때아닌(?) 혁신의 바람이 불고 있습니다. 국가와 공무원집단도 마찬가지지요. 무엇을 위한 ‘혁신’인지는 모르겠지만 자신들에게 문제점이 있는 것을 알고 그것을 고쳐보자는 취지는 나쁘지 않은듯 합니다. 하지만 ‘혁신’을 위한 혁신이 대부분이고 과한 경쟁으로인한 실적위주의 일처리 방식은 과거 공무원이 보여주었던 나태하고 안일한 모습과 다를바 없다는 생각이 들었습니다.</p>\n<p><a href=\"http://www.whynhows.com/wp-content/uploads/2014/03/P20110423_1000000136.jpg\"><img src=\"%7B%7B%20site.baseurl%20%7D%7D/assets/P20110423_1000000136.jpg\" alt=\"P20110423_1000000136\"><br>\n</a></p>\n<p>제가 오늘 말하고자 하는바가 공무원에 대해서가 아닙니다. 하지만 한국의 공무원에 대해서 잠깐 언급한것은 영국의 사회혁신 리포트《올리버는 어떻게 세상을 요리할까?》에 소개된 여러 사례에서 보여주는 관공서의 역할 때문입니다. 현대사회의 문제점을 분석하여 창의적인 해결책을 찾아내는 것이 어찌보면 정부나 관공서의 역할 같아 보입니다. 하지만 실제적으로 이러한 일을 도맡아 하는 곳은 관공서가 아니라 사회단체 및 사회적 기업입니다. 사실 정부는 여러 사회문제에 대해서 분석하여 예산을 편성하는 등의 큰 그림은 그릴수 있을지 몰라도 실제로 사회 깊숙히 들어와 진짜 문제가 무엇이고 무엇을 어떻게 해결해야 하는지 구체적으로 알지는 못합니다. 그리고 현대사회의 문제들은 수없이 많지만 정부가 이 모든 문제들을 단순히 돈으로 해결하기에는 너무나 복잡합니다. 그렇기 때문에 우리사회 곳곳에 사회적 기업이 필요한 것입니다. 어떤 사회문제에 대한 근본적인 해결을 위해서는 정부의 예산이 얼마가 편성되었느냐가 아니라 구체적으로 어떠한 돈을 어디에 얼마만큼 적절히 쓰느냐가 더 중요한 것입니다. 정부가 하지 못하는 일을 사회적 기업이 대신해주는 것이지요. 이것이 사회적 기업이 하는 일이라 할수 있겠습니다.</p>\n<p>저는 사회적 기업에 관심이 많고 사회적 기업에 대해서 공부하고 있습니다. 이 책을 읽은 이유도 이것이지요. 하지만 저는 이 책에서 보여준 대부분의 사회적 기업의 모습은 사회적 기업이라기 보다는 사회단체에 가깝다는 생각을 했습니다. 물론 좋은일을 하자는 취지는 똑같을지 모르겠지만 ‘기업’이라는 것은 확실한 비즈니스 모델이 있어야 한다고 생각합니다. 사회적기업과 사회단체의 가장 큰 차이점이 바로 하는일을 통해 돈을 벌수 있냐 없냐라는 것이지요. 그래서 사회적 기업을 창업 하려고 할때, ‘지원금으로 하지 뭐’식의 사고방식은 반드시 지양해야 합니다. 사회적 기업은 영세한 경우가 대부분이라 지원금이 불가피할 경우도 있지만 회사의 운영이 지원금에 의존되어서는 안됩니다. 예를들어 정권이 바뀌거나 예산편성이 바뀌는 경우처럼 지원금은 언제라도 없어질수 있기 때문입니다. 회사가 지원금에만 의존하고 있었다면 이런경우에는 십중팔구는 망하고 말겠죠.</p>\n<p>또 한가지 말하고 싶은것은 현재 대한민국 정부에서 사회적 기업을 바라보는 시각에 대해서입니다. 우리나라에서 정의하는 사회적기업은 한가지의 관점에 국한되어 있습니다. 바로 ‘고용’입니다. 기업을 만듦에 있어 중요한 것이 이윤추구가 아니라 고용이라는 것이지요. 이윤추구를 위해 고용하는 것이아니라 고용을 위해 이윤을 추구한다는 것이 한국에서 인정하는 사회적기업의 모델입니다. 예를들면 장애인 바리스타를 고용하여 운영하는 까페, 새터민이나 이주여성으로만 구성된 공장을 운영하는 회사 등이 있습니다. 이러한 형태의 기업도 당연히 사회적 기업입니다. 하지만 고용만을 위한 것만이 사회적기업은 아닙니다. 사회적기업이라는 것은 현존하는 사회문제를 기존의 방식과는 다른 창의적인 방법을 통해 고용창출, 빈민구제, 저소득층 지원, 환경문제 해결 등을 실현하는 기업이라 할 수 있습니다. 현재 한국사회에서 가장큰 문제중에 하나가 실업문제임을 감안한다면 고용창출이 사회적 기업을 결정하는 기준이 된것을 이해할수 있지만, 앞으로 한국사회의 다양한 문제들을 효과적으로 해결하기 위해서는 사회적 기업을 결정하는 기준을 확대할 필요가 있습니다.</p>","frontmatter":{"title":"","date":null}}},"pageContext":{"slug":"/role-of-social-venture/","previous":{"fields":{"slug":"/shaping-memories/"},"frontmatter":{"title":""}},"next":{"fields":{"slug":"/learning-from-mountain/"},"frontmatter":{"title":""}}}}