{"data":{"site":{"siteMetadata":{"title":"bono's blog","author":"bono"}},"markdownRemark":{"id":"498bf9c5-8abc-5e70-bc04-f814aaa2a7f9","excerpt":"…","html":"<p>우드슬랩(구글 검색결과)이 유행인가보다. 우드슬랩이란 통원목 테이블을 말한다. 형태가 잘 떠오르지 않는다면(혹은 구글 검색 결과를 클릭해보지 않았다면), 카페에서 흔히 보이는 테이블을 상상하면 된다. 보통 규격화 된 사각 원목테이블을 만들 때는 가공한 나무 조각을 여러개 이어 붙여 만든다. 그런데 우드슬랩은 하나의 통원목으로 테이블을 만든다. 그래서 가격도 비싸다. 통원목을 그대로 잘라 만들다보니 모서리가 울퉁불퉁하고 옹이 부분이 군데군데 비어 있는 경우도 더러 있다. 누구는 이렇게 깔끔하지 않은 형태를 선호하지 않을 수도 있다. 하지만, 우드슬랩을 원하는 사람들은 이렇게 가공되지 않은 날것의 유니크함에 더 열광한다.</p>\n<p>나에게 훌륭한 디자인이란 조화로움이다. 이탈리아의 도시 피렌체를 예로 들어보자. 피렌체는 건물 지붕의 색이 엷은 주황색으로 거의 동일하다. 건물의 형태는 도로에 따라 조금씩 다르지만 높이는 거의 비슷하다. 벽과 지붕의 색상도 거의 같다. 이런 건물로 둘러쌓여있어서인지 모르겠지만, 피렌체 두오모에 올라보면 도시 전체가 하나의 완성된 모습이라는 느낌이 든다(이 역시 사람에 따라 다르다). 그런데 만약에 이런 도시에 가운데 커튼월(유리벽)로 감싼 초고층 빌딩이 들어선다면 어떻겠는가? 아니면 혼자만 완전히 다른 색과 다른 모양의 현대적인 건물이 들어선다면 또 어떻겠는가? 그럴리는 없겠지만(아마 시에서 허가하지 않을거다) 지금까지 이어오던 피렌체의 명성이 하루아침에 날아가 버릴지도 모른다.</p>\n<p>조화로움은 꼭 도시만의 얘기는 아니다. 집안에서도 조화로움은 중요하다. 사람들이 한 브랜드의 가구를 사는 것도 같은 이유라 생각한다. 같은 브랜드의 가구는 디자인이 비슷하고 디자인이 비슷하면 아무래도 조화롭게 느낄수 있다. 반대로 모양도 형태도 스타일도 제각각인 가구를 하나씩 구매했다고 생각해보자 이리 배치해보고 저리 배치해봐도 조화롭게 만들기는 어렵다.</p>\n<p>아파트는 인위적이다. 싱크대의 수납장, 각진 인공대리석의 싱크대 상판, 실크벽지, 네모 반듯한 타일의 아트월 등 새 아파트에 들어서는 인테리어는 인위적이다(가격 문제도 있을거다). 그런데 여기에 우드슬랩 식탁을 놓는다 상상해보자. 쉽게 어울릴것 같지 않다.</p>\n<p>어떤 카페가 있다. 벽에는 별다른 마감을 하지 않아 콘크리트가 그대로 노출되어 있다. 천정도 막지않아 공조도 모두 오픈되어 있다. 인테리어의 대부분은 나무나 벽돌 또는 철판이다. 재료의 질감이 모두 살아있다. 요즘 많이 볼 수 있는 카페, 레스트랑의 모습이다. 이런곳에 형태가 일정치 않은 기다란 우드슬랩 테이블이 놓여있다고 상상해보자. 아주 잘 어울린다.</p>\n<p>훌륭한 디자인이라는건 주관적인 기호에 가깝다. 누군가에게는 형편없지만 다른 누군가에게는 최고의 디자인일수 있다. 그래서 내 디자인 취향을 남에게 강요해서는 안되고 남의 선택에 대해서도 왈가왈부해서는 안된다. 하지만 날것은 날것들과 더 어울린다(지극히 주관적인 생각이니 오해마시길). 가구를 살때 그 가구의 디자인만 봐서는 안된다. 집에 사용하는 가구의 형태와 색상, 질감을 상상해보고 사려는 것과 잘 어우러지는지 가늠해봐야 한다. 만약 그렇지 않다면 아무리 아름답다 하더라도 포기하는게 맞다. 옷이라면 안입으면 그만이지만 가구는 가격도 비싸고 오랫동안 함께 지내야하기 때문이다.</p>","frontmatter":{"title":"아파트와 우드슬랩 식탁이 어울릴까?","date":"July 06, 2018"}}},"pageContext":{"slug":"/2018/07/06/wood_slab_table/","previous":{"fields":{"slug":"/2018/07/04/interpret_text/"},"frontmatter":{"title":"텍스트는 해석하기 나름이다."}},"next":{"fields":{"slug":"/2018/07/08/went_ikea/"},"frontmatter":{"title":"이케아를 다녀왔습니다."}}}}