{"data":{"site":{"siteMetadata":{"title":"bono's blog","author":"bono"}},"markdownRemark":{"id":"82263424-53e7-5255-822a-286fbaec9523","excerpt":"제너럴리스트(generalist)라는 단어는 다치바나 다카시의 저서 ‘뇌를 단련하다’에서 처음 알게 되었다. 제너럴리스트(generalist…","html":"<p>제너럴리스트(generalist)라는 단어는 다치바나 다카시의 저서 ‘뇌를 단련하다’에서 처음 알게 되었다. 제너럴리스트(generalist)는 사전적으로 ‘모든 일에 능숙한 사람’ 과 같은 의미를 가진다. 책에서는 뉘앙스가 조금 다른데, 모든 일에 능숙하기 보다는 다양한 분야에 폭넑은 지식을 가지고 종합적으로 사고하는 사람을 뜻한다. general 이라는 단어가 ‘일반적인’이라는 의미로 많이 쓰이지만, ‘장군’이라는 뜻으로도 쓰인다. 장군은 하나의 전문화된 특기는 없지만, 군에서 돌아가는 대부분을 알고 있으며 이를 바탕으로 종합적인 판단을 내린다.</p>\n<p>제너럴리스트는 한 분야에 뛰어난 지식은 없을지 몰라도 여러 분야에 대한 지식을 두루 갖추고 있다. 그래서 한쪽으로 치우치지 않고 종합적으로 사고한다. 바로 리더같은 사람들처럼 말이다. 제너럴리스트의 반대는 스페셜리스트(specialist)다. 스페셜리스트는 전문가를 의미한다. 한 가지 분야에 깊은 지식과 경험을 가지고 있는 사람이다. 교수나, 운동선수, 의사 등이 스페셜리스트에 속한다.</p>\n<p>그렇다면 제너럴리스트와 스페셜리스트 중 어느 집단이 더 뛰어날까? 리더가 제너럴리스트인 경우가 많다고 해서 반드시 제너럴리스트가 뛰어나다고 말할 수 없다. 예를들어 전기공사가 필요하다면 두루두루 알고 있는 제너럴리스트보다는 전기 분야에 전문가인 스페셜리스트가 적합하다. 또는 생사가 걸린 환자가 있다면, 환자의 병에 특화된 전문의(스페셜리스트)가 수술하는게 바람직하다. 즉, 제너럴리스트와 스페셜리스트 중 어느 집단이 더 뛰어나다는 것은 어불성설이다. 단지 맡은 업무의 종류와 성격에 따라 적합한 집단이 다를뿐이다.</p>\n<p>나는 제너럴리스트를 지향한다. 내가 리더에 맞는 사람이라서 그런건 아니다. 이는 내 성격과 관련있다. 우선 나는 한 분야에 몰입하기가 힘들다. 끈기가 없어서일수도 있지만, 호기심이 많아서 그렇다고 볼 수도 있다. 하나에 빠져있다가도 어느새 다른쪽에 관심을 기울인다. 대학에서 건축을 공부하고 실무에서 일하다가 서른이 되어서 프로그래밍에 빠진것도 비슷한 맥락이다. 한가지 아쉬운점은 너무 쉽게 관심사가 바뀌는 것이다. 다양한 분야에 폭넓은 지식을 가지기 위해서는 최소한의 시간은 투자해야한다. 흔히 말하는 <code class=\"language-text\">1만시간의 법칙</code> 처럼 1 만 시간(하루 3 시간이면 거의 10 년)을 투자하지 않더라도 최소 3 년 정도는 꾸준할 필요가 있다. 영어공부를 해야겠다하면 꾸준하게 3 년 이상 해야 할 것이고, 글쓰기를 한다면 일주일에 최소 몇개 이상 3 년은 써봐야 글쓰는 실력도 좋아질 것이다.</p>\n<p>또 한가지는 내 삶의 방향과 관계 있다. 건축할때도 마찬가지고 프로그래머로 살고 있는 지금도 마찬가지인데, 이 분야에 전문가가 되어 평생 살고 싶다는 생각이 없다. 나만의 일을 갖고 싶고 나만의 회사를 만들고 싶다. 대기업같은 회사를 만들겠다는건 아니다. 일하고 싶을때 일하고, 일할 수 있는 나이까지 일하고, 쉬고 싶을때 쉴수 있는 일을 하고 싶다. 굳이 말하자면 1 인 기업에 가까운 형태다. 그런데 1 인 기업을 운영하기 위해서는 스페셜리스트로는 무리가 있다. 일의 성격에 따라 다르겠지만, 경영에서 부터 회계 및 운영 전반을 혼자서 책임져야한다. 그렇기 때문에 다양한 분야의 지식을 쌓는것은 필수다.</p>\n<p>나는 회사에 고용되어 하루에 8 시간씩 매여있기 싫다. 우리가 회사에 고용되어서 받는 혜택도 많이 있지만, 반대로 회사에 고용되었기 때문에 포기해야하는 일도 많다. 예를 들면 몸이 좀 안좋아도 마음대로 쉴수 없는 것이나, 아이와 맘껏 놀아주지 못하는것 등이 있다. 결정적으로 회사는 이익을 추구하는 집단이기 때문에 내 미래를 절대 보장해주지 않는다.</p>\n<p>나만의 일을 만들자.</p>","frontmatter":{"title":"스페셜리스트(specialist) vs 제너럴리스트(generalist)","date":"July 19, 2018"}}},"pageContext":{"slug":"/2018/07/19/specialist_vs_generalist/","previous":{"fields":{"slug":"/2018/07/17/why_am_i_distracted/"},"frontmatter":{"title":"나는 왜 산만할까?"}},"next":{"fields":{"slug":"/2018/07/21/my_reading/"},"frontmatter":{"title":"나의 책 읽는 방법"}}}}