{"data":{"site":{"siteMetadata":{"title":"bono's blog","author":"bono"}},"markdownRemark":{"id":"ff0c1c53-6740-58e3-93d6-6dee4c6ef50a","excerpt":"하루에 얼마나 걸으시나요? 2,000 보? 5,000 보? 걸음의 수를 정확히 측정할 수는 없지만 하루에 5,00…","html":"<p>하루에 얼마나 걸으시나요? 2,000 보? 5,000 보? 걸음의 수를 정확히 측정할 수는 없지만 하루에 5,000 보 이상을 걷는 사람은 그렇게 많지 않을 것이라 생각이 듭니다. 아침에는 지하철을 타러 갈때나, 환승할 때나, 지하철에서 내려 회사까지 걸어갈 때 걷고, 저녁에 퇴근할때는 이와는 반대 순서로 걷게 되지요. 조금 나은 사람들은 멀지 않은 거리는 걸어 다니거나, 점심시간에 산책을 하는 정도가 있겠습니다. 하지만 이 정도 걷는다고 하더라도 정작 계산해보면 그 숫자는 결코 많지 않다는 것을 알 수 있습니다.</p>\n<p>한 사람의 평균 보폭을 70cm 정도(참고 자료에 의하면 젊은 여자의 경우 70cm 정도이고 남자는 74cm 정도라고 합니다)라고 가정하고 시간당 4km 를 걷는 사람이 한시간 동안 걷게되면 그 사람의 총 보폭수는 5,714 보 정도가 됩니다. 지하철역까지 5 분, 환승 5 분, 회사까지 10 분 정도로 가정하고 저녁에도 이를 반복하게 되면 보통 하루 40 분 정도를 걷게 되는데, 보폭수로 따져보면 약 3,809 보가 되고 소모칼로리는 대략 150Kcal 가 되겠지요(걷는 사람의 몸무게와 걷는 속도가 변수로 작용하겠지만 대략적으로는 이 정도 수치가 나온다고 간주합니다). 그나마 지하철이나 버스등의 대중교통을 타고 다녀야 이정도의 보폭수와 소모 칼로리가 발생하게 됩니다.</p>\n<p>그렇다면 자동차를 타고 출퇴근하는 사람들의 경우는 어떨까요? 이들이 출퇴근하는 모습을 상상해봅시다. 우선 집을 나서서 집앞에 주차된 자동차까지 걸어갑니다. 자동차 시동을 걸고 회사 지하주차장까지 앉아서 운전합니다. 그리고 주차장에 차를 세워둔 다음 근처에 있는 엘리베이터까지 걸어가겠지요. 그 다음 엘레베이터를 타고 사무실이 있는 층까지 올라와서 자신의 자리까지 걸어서 들어갑니다. 만약 이런 방식의 출퇴근이라면 집에서 나와서 자동차까지, 회사 주차장에 세워둔 자신의 차에서 엘레베이터까지, 엘레베이터에서 회사안 자기 자리까지 걷는 것만이 출근 동안 걷는 걸음 수의 전부일 것입니다. 퇴근시에도 반복한다고 가정하고 그 수에 2 를 곱하면 이 사람이 하루동안 출퇴근을 통해 걷는 총 걸음 수가 나오게 됩니다. 하지만 그 수는 많아도 1,000 보에 미치기 어려울 것입니다.</p>\n<p>위에 보시는 사진은 오래전에 유행하던 만보기입니다. 하루 만보 걸으면 건강해진다는 말로 한때 너도나도 허리춤에 하나씩 가지고 다녔었지요. 그렇다면 하루에 만보를 걸으면 어느 정도의 효과가 있을까요? 위에서 3,809 보를 걸었을때 대략 150Kcal 가 소모된다고 했으므로, 이 수치를 10,000 보로 환산해보면 대략 400Kcal 에 조금 못미치는 칼로리 소모량이 나옵니다. 자전거를 한 시간 타야 300Kcal 정도가 소모되는 것을 감안하면 결코 낮은 수치는 아니지요.</p>\n<p>걷는 것이 런닝이나 다른 운동들보다 상대적으로 칼로리 소모량이 큰 것은 아니지만 걷기 운동에는 여러가지 장점이 있습니다. 바로 아래와 같은 것들이지요.</p>\n<ul>\n<li>\n<p>심폐기능 상승 및 혈액순환 촉진</p>\n</li>\n<li>\n<p>체지방 감소 및 성인병 예방</p>\n</li>\n<li>\n<p>골밀도 유지로 인한 골다공증 예방</p>\n</li>\n<li>\n<p>스트레스 해소 및 불안감, 우울증 해소</p>\n</li>\n<li>\n<p>면역력 증가</p>\n</li>\n</ul>\n<p>위와 같은 내용들은 당연하고 익히 알려진 장점들입니다. 하지만 조금만 생각해보면 거의 모든 운동들이 위와 같은 장점들을 가지고 있는 것을 알 수 있습니다. 그렇다면 과연 운동으로서의 걷기가 아닌 걷기 자체만으로의 장점은 어떤 것이 있을까요? 제가 걷는 것을 좋아하고 또 즐겨 하기 때문에 제 경험을 바탕으로 한 장점 몇 가지를 추려보면 다음과 같습니다.</p>\n<h3>사색</h3>\n<p>걷는 것은 곧 생각하는 것과 연결됩니다. 단순히 걷기 때문에 생각되어 지는 것이 아니라 걷기와 생각하는 것 사이에는 좀 더 과학적인 근거가 존재합니다. 사람의 몸은 땅에 발을 내딛을 때마다 발의 신경부터 시작해서 온몸의 근육이 걷는 행위 중에 균형을 잃지 않도록 활동하게 됩니다. 걷는 행위라는 것은 이러한 움직임의 반복이기 때문에 활발하게 활동하는 신경과 세포들이 뇌신경의 활동에도 영향을 미쳐서 사색(생각)으로 이어지는 것입니다.</p>\n<h3>관찰</h3>\n<p>도보 여행을 해본 사람들이라면 다들 알고 있을 거라 생각합니다. 걷는 것은 기차나 자동차를 타고 지나가는 것과 다릅니다. 기차나 자동차를 타고 가면서 보는 창밖의 풍경들에서는 놓쳤던 많은 것들을 걸음을 통해 모두 관찰할 수 있습니다.</p>\n<h3>대화</h3>\n<p>걸음은 자신과의 대화를 가능하게 합니다. 아무도 없고 아무 소리도 나지 않는 조용한 시골길이나 텅빈 도로를 혼자서 걷다보면 자연스럽게 자신이 누구이고 어디로 가야하는지에 대한 깊은 생각에 빠지게 됩니다.</p>","frontmatter":{"title":"걸음에 대한 단상","date":"April 19, 2012"}}},"pageContext":{"slug":"/think-about-walking/","previous":{"fields":{"slug":"/presentaional-component-container-component/"},"frontmatter":{"title":"[번역] 프레젠테이션 컴포넌트와 컨테이너 컴포넌트"}},"next":{"fields":{"slug":"/why-did-i-quit-a-job-in-architecture/"},"frontmatter":{"title":""}}}}