{"data":{"site":{"siteMetadata":{"title":"bono's blog","author":"bono"}},"markdownRemark":{"id":"6310b1f1-18eb-5a7a-8413-a837aec921c0","excerpt":"- — layout: post comments: true title: 산에게서 배웁니다. date: 2011-04-13 21:58:28.000000000 +09:00 type: post published: true status: publish…","html":"<p>-— layout: post comments: true title: 산에게서 배웁니다. date: 2011-04-13 21:58:28.000000000 +09:00 type: post published: true status: publish categories: essay tags: - 등산 - 비로봉 - 산 - 원주 - 치악산 meta: _edit_last: ‘1’ _wpas_done_all: ‘1’ _thumbnail_id: ‘315’ _aioseop_keywords: 등산, 비로봉, 산, 원주, 치악산 _aioseop_title: ‘산에게서 배웁니다. ’ dsq_thread_id: ‘3046095126’ author: login: blueshw email: blueshw83@gmail.com display_name: blueshw first_name: ” last_name: ” ---</p>\n<p>최근 많은 일이 있었습니다. 신변의 변화가 있었고, 그 변화로 인한 심정의 변화가 있었습니다. 그러다보니 자연스럽게 블로그에 거의(?) 무신경해져 버린것 같습니다. 인생의 터닝지점이 되는 순간이라 생각했기 때문에 나름의 휴식도 가질겸, 짧게 여행을 다녀왔습니다. 처음에 계획했던대로 못한것은 아쉽지만 짧은 기간동안 새로운 경험을 통해 생각할 시간을 가질 수 있었던 것은 참으로 다행이었던것 같습니다.</p>\n<p>저는 산을 다녀왔습니다. 처음에는 하루에 한봉우리씩 총 네 곳의 정상에 도전하는 거창하고도 무모한(?) 계획을 세웠습니다. 제가 왜 그랬는지 잘 모르겠습니다만 아마도 산을 너무 우습게 봤던 것 같습니다. 그리고 등산 경험도 전무한 제가 저 스스로를 너무 과대평과 했던것도 있구요. 경기도 양평의 용문산을 시작으로 원주 치악산, 단양 소백산 그리고 마지막으로 지리산 정상에 올라 대피소에서 하룻밤 묵는 것이 저의 계획이었습니다. 등산 고수님들이 이 계획을 보시면 너무 무모하다 생각하실지 아니면 겨우 이정도 가지고 뭘 그리 유난 떠냐고 하실지는 모르겠습니다만 어쨌든 등산 초보인 저에게는 굉장히 무모한 계획이었다라는 느낌을 받았습니다. 그래서 결국에는 용마산과 치악산 비로봉까지만 오르는 것으로 마무리 짓게 되었습니다.</p>\n<p>산에 올라가신분들은 아시겠지만 산은 굉장히 위험합니다. 모든산이 그렇진 않습니다만 제가 올랐던 두 곳은 바위로 이루어진 산이라 보통의 토산보다는 위험했습니다. ‘여기서 미끄러지면 바로 죽을꺼야’라는 생각은 다리를 후들거리게 만들고 머리를 어지럽게하지만, 그만큼 위험이 눈앞에 있기에 더욱 조심하게 됩니다. 이렇게 위험을 감수하며 스릴을 추구하는 것이 바로 등산의 묘미이기도 하지요. 그리고 끝없이 오르기만 하다가 정상에 올랐을때 느껴지는 희열 또한 산을 사랑할수밖에 없게 만드는 이유인것 같습니다.</p>\n<p><a href=\"http://www.whynhows.com/wp-content/uploads/2014/03/P20110410_10000001222.jpg\"><img src=\"%7B%7B%20site.baseurl%20%7D%7D/assets/P20110410_10000001222.jpg\" alt=\"P20110410_1000000122\"></a></p>\n<p>산을 오르는 일은 인생과 비슷합니다. 사람들이 정상을 향해 끝없이 오르는것 처럼 인생에서 성공이라는 정상에 오르기 위해서는 끊임없이 노력해야 하고 그 노력의 결실을 맺기 전까지는 오로지 노력하는 일밖에 없습니다. 그리고 어느덧 정상에 오르면 그동안의 노력의 고통은 아무것도 아닌것이 되고 눈앞의 광경에 넋을 놓게 되지요. 정말 꿀맛같은 기분입니다. 마찬가지로 인생에서도 엄청난 노력끝에 얻게되는 성공의 맛은 정상에 올랐을 때의 그 기분과 크게 다르지 않을 것입니다.</p>\n<p>이처럼 정상에 오르는것도 중요하지만 사실 그것이 전부는 아닙니다. 정상에 오른 그 기분이 좋은 것은 사실이나 정상에 오르는 것만이 산을 찾는 이유는 아닐 것입니다. 새벽 일찍부터 오르기 시작하여 정상에 올라 정오가 지나자마자 빠르게 내려오는 사람들이 있는 반면 시간을 두고 천천히 오르면서 산의 기운과 자연의 정취를 즐기려는 사람들도 많이 있습니다. 또한 정상에 오르는 것만이 목적이 아니라 여러 사람들과 함께 오르면서 자연을 즐기며 즐거움을 찾는 사람들도 있지요.</p>\n<p>저 또한 산을 오르는 동안 지금 저의 상황과 산을 오르는 모습을 대비시켜보았습니다. 불안하고 불명확하고 이룬것 없이 혼란스럽고 남들에게 뒤쳐지는 것만 같은 현재의 상황에서 정상만을 바라보며 산을 오르는 모습은 내가 추구하는 가치와는 다른 모습이었습니다. 물론 정상을 오르는 것을 목표로 삼고 산을 찾았지만 정작 산을 오를때에 중요한 것은 경쟁이나 속도가 아니라 스스로의 방향과 페이스를 가지고 천천히 한발한발 올라가는 것이었습니다. ‘왜 내가 남들보다 먼저 정상에 오르지 못한 것일까?’ 혹은 ‘저 앞에 가는 사람보다 내가 먼저 가야지’라는 생각은 자칫 잘못하면 대형사고로 이어질수 있습니다. 모든 사람들은 그들 스스로가 정한 목적과 목표가 있는 것이고 그들 스스로의 페이스가 있는 것이기 때문에 내가 저 사람보다 뒤쳐지는 것은 아무 의미 없는 것입니다. 인생에서도 마찬가지입니다. 내가 친구보다 좀 더 늦게 취직을 했다거나 연봉이 적다거나 하는 것은 지금 순간의 문제일뿐이지 내가 친구보다 뒤쳐지는 것이 아닙니다. 중요한 것은 나의 목표가 무엇이고 내가 지금 가고 있는 길이 나의 목표를 향하고 있느냐는 것이지요.</p>\n<p>얼마전, 기로에 서있던 저는 한가지 길을 선택했습니다. 제가 선택한 그 길이 더 나은 길인지는 두고봐야겠지만 적어도 제가 선택한 길이 제 인생의 목표의 방향으로 향하고 있다고 믿습니다. 그리고 그 길을 걸어가는 그 과정을 제대로 즐겨볼 생각입니다.</p>","frontmatter":{"title":"","date":null}}},"pageContext":{"slug":"/learning-from-mountain/","previous":{"fields":{"slug":"/role-of-social-venture/"},"frontmatter":{"title":""}},"next":{"fields":{"slug":"/need-conversation/"},"frontmatter":{"title":""}}}}