{"data":{"site":{"siteMetadata":{"title":"bono's blog","author":"bono"}},"markdownRemark":{"id":"0b01dfe3-9e42-5061-8476-e997e9d67c10","excerpt":"…","html":"<p>한창 사업준비에 몰두하고 있을때였습니다. 기획이 어느정도 진행되었고, 이제는 우리가 생각해왔던 것이 실제로 가능한 것인지, 어느정도의 시간과 노력이 필요한 것인지를 알고 싶었습니다. 전에 언급했던것 처럼 당시에는 절대로 개발자를 구할 수 없는 상태였습니다. 사무실도 구하지 못하고 친구 삼촌네 사무실에 기생하고 있었고, 점심값도 아끼려고 이리저리 돌아다니며 여러 사람들에게 얻어 먹던 상황이었으니까요. 이런 상태에서 개발자를 고용한다는 것은 사치나 다름 없었습니다. 더군다나 기획한 프로젝트가 제대로 될지 안될지도 모르는 상황이었는데 무리를 할 필요는 없었지요. 수 년째 개발일을 하고 있던 친구 지인분이 우리에게 해준 조언 덕택에 우리가 기획한 서비스가 단기간에 고용한 개발자 한두명으로는 어림없다는 것을 알게된 것도 무조건적으로 개발자를 고용해야한다는 생각에서 깨어나게 해주었습니다.</p>\n<p>우리 기획이 잘못된 것인가? 베타버전을 만들어 보기 위해서라도 조금더 간단하고 단순화된 형태로 바꿔야하나? 이런 생각들로 몇날 며칠을 보내고 있었습니다. 당시에 앞으로 사용할 회사이름으로(아직 회사를 설립하지 않았기에 이름만 있음) 티스토리 블로그를 이용하여 만들어 운영중이었습니다. 아시다시피 티스토리는 설치형 블로그의 형태를 띈 가입형 블로그입니다. 즉, 사이트에 종속되어 있어 따로 자신의 웹서버를 구축할 필요가 없고(가입형), 사용자에게 블로그 수정의 자율성이 보장(설치형)됩니다. 대표적인 가입형 블로그에는 네이버나 다음 블로그가 있고, 대표적인 설치형 블로그에는 지금 제가 사용하는 워드프레스가 있습니다. 양쪽 다 워낙 유명해 따로 설명할 필요는 없을 것 같네요.  티스토리가 수정이 된다고는 하지만   워드프레스 만큼이나 방대하고 자유롭게 수정이 가능하지는 않습니다. 티스토리에서만 제공하는 플러그인을 사용해야하고 일부 소스를 수정하는 정도에 불과하지요. 워드프레스를 사용해보신분은 아시겠지만 테마와 플러그인을 사용자가 직접만들고 배포할수 있다보니 어마어마하게 방대한 종류의 테마와 플러그인이 있습니다. 그래서 웬만한 플러그인만 잘 사용하면 코드 한줄 고칠 필요 없이 쉽게 블로그를 꾸밀 수 있지요.</p>\n<p>친구와 저 중에서 그나마 제가 컴퓨터와 친하고 컴퓨터 작업을 좋아했던 터라 회사 블로그의 제작과 운영을 제가 맡게 되었습니다. 처음에는 어떻게 블로그를 만들까 고민하다가 팀블로그로 사용이 가능한 티스토리를 선택하게 되었습니다.네이버 블로그를 사용했더라면 아무런 고민도 없이 네이버에서 제공하는 템플릿으로 뚝딱 만들어버렸겠지만, 가입도 번거럽고(초대 메일을 받아서 가입해야함) 노출도 네이버에 뒤지는 티스토리 블로그를 선택한 것은 오로지 팀블로그 기능 때문이었지요. 사실 친구와 저와 아이디를 공유하면서 하나의 아이디로 글을 써도 무방한 것인데 그때는 그게 뭐가 그리 중요하게 느껴졌는지 꼭 티스토리로 만드러 보고 싶더라구요. 아무튼 티스토리를 선택했으니 어느정도 소스 수정은 필요할 상황이었습니다. 티스토리에서 제공하는 템플릿을 그냥 써도 괜찮지만 무슨 오기에 그래도 우리 색이 담긴 블로그니깐 뭔가 우리가 원하는 모습이 필요하겠다 생각이 들었습니다.</p>\n<p>이 때 저는 HTML 태그 사용도 거의 하지 못하는 바닥 수준이었습니다. 사용해본 태그라고하면 고등학교시절 친구들 사이에서 사용하던 글자에 색 넣기, 글자 움직이기, bold 처리, 이미지 불러오기 정도가 전부였지요. 그래서 학원에 몇달 다니며 HTML 을 익힌 와이프에게 물어가며 블로그에 로고를 입히고 디자인을 변경하는 등 조금씩 우리가 생각하는 모습대로 만들어 갔습니다. 블로그 수정이라고 별게 있겠냐 싶지만, IT 지식이 거의 없는 상태에서 원하는 모습대로 만드는게 생각보다 쉬운일이 아니었습니다. 원하는 모양과 기능을 어떠한 코드(태그)로 만들어야 되는지를 알면 검색이라도 하겠는데 아무것도 모르니 검색 또한 쉽지 않았습니다. 어떤 날은 풀리지 않는 문제로 씨름하다 밤을 새기도 했지요. 몇날 며칠을 별로 수정한 것도 없는데 그렇게 어렵게 또 어설프게 드디어 우리가 앞으로 만들어갈 회사의 블로그를 만들었다는 뿌듯함 때문에 괜시리 기분이 좋아지더라구요. 만드는 과정 자체도 재미있기다고 느끼기도 했습니다. 특히 풀리지 않은 문제를 만났을때 느껴지는 극도의 스트레스도 막상 문제가 해결되었을 때의 희열은 이루 말할 수 없는 정도였습니다.</p>\n<p>블로그를 만들었던 이 경험은 내 안의 뭔가를 바꿔 놓았습니다. IT 분야를 이끌어가는 이 기술인 프로그래밍에 대한 호기심이 발동하기 시작한 것이죠. 그렇다고 당장에 사업을 때려치우고 개발자가 되겠다는 생각은 전혀 없었습니다. 단지 친구와 제가 어렵게 만들어 놓은 기획을 배우고 익히다 보면 나 스스로도 만들 수 있지 않을까, 그런 생각 정도였습니다. 지금 생각해보면 잠깐 프로그래밍을 배운다고해서 뚝딱뚝딱 만들 수 있을만큼 간단한 것도 아니었는데, 당시에는 뭔가 희미한 안개속에서 뭔가 형체가 보이듯이 금방 만들 수 있을것만 같았습니다. 그래서 일단 프로그램을 공부하기 위해서 무엇을 먼저 해야할까 찾아보았습니다. 와이프가 조언하길 아무것도 모르는 상태에서 혼자 공부하려면 더 힘드니 학원에 한번 다녀보면 어떠냐고 그러더라구요.</p>\n<p>그래서 학원으로 달려갔습니다.</p>","frontmatter":{"title":"건축에서 프로그래머로(3) – 내가 직접 만들어 볼까?","date":"October 25, 2014"}}},"pageContext":{"slug":"/from-architect-to-progammer-3/","previous":{"fields":{"slug":"/from-architect-to-progammer-4/"},"frontmatter":{"title":""}},"next":null}}