{"data":{"site":{"siteMetadata":{"title":"bono's blog","author":"bono"}},"markdownRemark":{"id":"703b51f5-df97-5991-93a1-c23d5c78636e","excerpt":"<유시민의 글쓰기 특강>, 내가 처음 완독한 유시민 작가님(앞으로 존칭은 생략한다)의 책이다. 1…","html":"<p>&#x3C;유시민의 글쓰기 특강>, 내가 처음 완독한 유시민 작가님(앞으로 존칭은 생략한다)의 책이다. 15 년 정도 전에 발간된 &#x3C;경제학 카페>를 읽으려고 시도한적은 있었다. 왜 그랬는지 이유는 잘 기억나지 않지만, 앞 부분만 조금 읽고 그대로 덮어버렸다. 그래서 어떤 책이었는지 전혀 기억나지 않는다. 내 기억에 15 년 전에는 유시민에 대해 잘 몰랐다. 정치에 관심도 크게 없었기 때문에 이름만 알고 있는 수준이었다. 15 년이 지난 지금도 여전히 정치에 별 관심이 없다. &#x3C;유시민의 글쓰기 특강>을 선택한 계기는 별게 없다. 글쓰기에 대한 책이 뭐가 대단할까 싶어 보통은 안읽었는데(괜찮은 글쓰기 책은 몇권 읽어보길 추천한다), 그저 요즘 잘나가는 유시민(정치할 때보다 훨씬 나아보인다)이라서 선택했다. 지금 생각해보면 정말 탁월한 선택이었다.</p>\n<p>다른 글쓰기 책과 마찬가지로 유시민은 이 책을 통해 글을 잘 쓰기 위한 방법을 여럿 제시한다. 대부분은 다른책과 비슷하다. 꾸준히 써야하고 책을 많이 읽어야 한다는 등 일반적인 방법이다. 일반적인 방법이지만, 작가의 표현력과 구성에 따라 받아들이는 입장에서 더욱 크게 와닿을 수 있다. 예를 들어 단문과 복문에 대해 이렇게 설명한다(대여로 읽은 책이라 내 기억으로 재 구성한다, 참고로 문장에 주어와 서술어가 하나면 단문, 두개 이상씩이면 복문이라 한다).</p>\n<p>단문과 복문을 사용하는것은 노래에 비유할 수 있다. 지나치게 복문을 많이 사용하는 것은 노래 시작부터 끝까지 고음으로만 부르는것과 같다. 고음이 과학적으로 사람에게 큰 울림을 주는 것은 사실이나 처음부터 끝까지 고음만으로 노래를 하면 오히려 감동이 반감된다. K 팝스타에서 고음만으로 노래를 한 참가자에게 박진영이 얘기했다. 노래 자랑하러 나오셨나고… 노래에도 기승전결이 필요하다. 곡 전체가 고음으로 일관된 노래보다는 차분히 시작하면서 서서히 절정에 다다르는 노래가 사람들에게 전율을 느끼게한다. 글쓰기도 마찬가지다. 글 전체에서 복문을 주로 사용하는 것은 고음으로만 노래하는 것과 같다. 그보다는 읽기 쉬운 단문을 주로 사용하면서 자신의 주제를 드러낼때 복문을 사용하면 훨씬 효과적이다. 기승전결이 꼭 내용에만 국한되는지는 않는다. 단문과 복문을 사용할때도 기승전결의 구성이 필요하다.</p>\n<p>(내 기억으로 완전히 각색한) 이 대목에서 나는 지금껏 정말 글을 못쓰는 사람이었다는 사실을 깨달았다. 예전에 쓴 글을 보면 대부분 주어와 서술어가 여러개인 복문으로 도배되어 있었다. 그런 방식으로 쓰는 글을 잘 쓰는 글이라 믿었다. 나름대로는 어색하지 않게 여러번 퇴고하면서 썼다. 하지만, 읽는 이의 입장에서는 한번에 이해하기 어려운 문장 투성이었다. 유시민의 글과 책을 읽어보면 참 쉽게 읽힌다. 결코 쉬운 내용이 아님에도 쉽게 잘 읽히는건 단문을 주로 사용하기 때문이다. 반대로 문장 하나를 이해하기 위해서 여러번 반복해서 읽어야 하는 글도 있다. 이러면 흐름이 방해되어 글 전체에 대한 이해가 떨어진다. 번역서나 연구 서적에서 많이 볼 수 있는 형태다. 이런 글과 책을 쓴 사람들은 글쓰기에 대해 제대로 배운적이 없을 것이다. 그렇지 않고서야 이토록 읽기 어렵게 쓰지는 않았을 것이다. 아니면 많은 사람에게 읽히기 위함이 아니라 지식을 자랑하고 인정받으려고 일부러 어렵게 쓴것이 분명하다.</p>\n<p>이번 블로그를 만든 뒤로는 단문 위주로 글을 쓰려고 노력한다. 사람들이 읽기 쉬운 글을 쓰고 싶기 때문이다. 그렇다고 이 블로그의 목적이 글쓰기 연습이라고 단정지을수는 없다. 앞으로 어떤 주제로 글을 쓰게 될지는 정말 모른다. 주제가 무엇이든 사람들이 쉽게 읽을 수 있으면 좋겠다는게 내 마음이다. 혼자만의 비밀을 간직하기 위함이라면 어떻게 써도 상관없다. 하지만, 사람들과 공유하고 공감하기 위한 글쓰기라면 최소한 읽는 사람의 입장을 헤아려 글을 써야한다. 큰 가르침을 주신 유시민 작가님에 감사드린다.</p>","frontmatter":{"title":"단문과 복문 <유시민의 글쓰기 특강>","date":"July 09, 2018"}}},"pageContext":{"slug":"/2018/07/09/single_or_double_sentences/","previous":{"fields":{"slug":"/2018/07/08/went_ikea/"},"frontmatter":{"title":"이케아를 다녀왔습니다."}},"next":{"fields":{"slug":"/2018/07/10/why_work_during_40_hours/"},"frontmatter":{"title":"왜 회사에서 반드시 일주일에 5일동안 하루 8시간씩 근무해야할까?"}}}}