{"data":{"site":{"siteMetadata":{"title":"bono's blog","author":"bono"}},"markdownRemark":{"id":"26ff45bc-34c3-5d86-827e-0da17d632de6","excerpt":"…","html":"<p>나는 원래 시계를 잘 차지 않는다. 지금까지 살면서 시계를 오랫동안 착용해본적이 없다. 예전에 와이프가 선물했던 시계도 있었는데, 잠깐 차다 서랍에 넣어버렸다. 시계를 잘 안차는 이유가 뭘까? 시계를 차면 팔목에 땀이 차서 그런건지도 모른다. 특히 가죽밴드 시계를 차면 거의 재앙에 가깝다. 한 달만 착용해도 갈색밴드가 시커멓게 변해버리기 때문이다. 더럽고 냄새난다. 아니면 핸드폰이 있으니 시계가 필요함을 느끼지 못해서일지도 모르겠다. 시계가 시간을 보는거라고? 아니다. 시계는 시간을 보기 위한 용도가 아니다. 시계에 열광하는 대부분의 남자들은 시간을 볼수 있어서 열광하는게 아니다. 그들이 시계에 열광하는 이유는 여자가 반지와 목걸이에 열광하는 이유와 같다. 그래서 시계 가격도 브랜드에 따라 천차만별이고 심하게는 수천만원에서 1 억을 넘어가는 시계도 있다.</p>\n<p>시계를 거의 안차다가 몇년 전, 핏빗(fitbit)이라는 스마트밴드를 써보게 되었다. 스마트밴드는 스마트폰과 블루투스로 연결하여 동작하는 일종의 운동 보조기구다. 내가 핏빗을 구매한 이유가 특별히 운동을 위해서는 아니었다. 다만, 스마트폰 전화 알림이나 문자 알림과 같은 기능을 가진 뭔가 있으면 좋겠다고 생각했었다. 주머니나 가방에 스마트폰을 넣어두다보니 전화를 못받는 경우가 많아서 불편했기 때문이다. 물론 스마트밴드의 알림기능이 주 기능은 아니다. 주 기능은 운동량을 측정하고 걸음을 측정해서 칼로리 소비를 계산하는 등 운동을 도와주는 것이다. 핏빗은 스마트밴드 중에서는 꽤 고급 브랜드에 속한다. 요즘에는 미밴드 등 저렴한 스마트밴드도 많이 출시 되었지만, 처음 핏빗이 등장했을때는 꽤나 비싸게 판매되었다.</p>\n<p>핏빗을 일년 넘게 잘 사용하다가 어느날 잃어버렸다. 여름이었고 버스였다. 너무 땀이 많이 차서 잠깐 벗어두었다가 급하게 내리면서 놓고 내렸다. 너무 잘 사용하고 있었기 때문에 또 사고 싶었다. 하지만, 여전히 핏빗은 고가였고 그 가격이면 조금 더 보태서 스마트워치로 넘어가도 되겠다 생각했다. 그러다 페블(pebble)을 알게되었다. 페블은 킥스타터에서 성공적인 펀딩으로 화제를 불러일으킨 스마트워치의 조상격이다. 페블이 유명세를 타면서 이후 스마트워치가 우후죽순으로 쏟아져나왔다. 대표적으로 애플의 애플워치, 삼성의 기어시리즈가 있다. 애플워치나 기어시리즈도 훌륭한 제품이다. 하지만 가장 큰 단점으로 꼽히는게 바로 배터리다. 거의 매일 충전해야하고 하루라도 충전하지 않으면 방전되기 일쑤다. 나는 매일 충전할 자신이 없었다. 가격도 한몫했다. 치명적인 단점을 가지고 있으면서 가격도 만만치 않다. 그래서 페블을 사기로 마음먹었다.</p>\n<p>페블은 e-ink 를 사용하기 때문에 배터리 지속시간이 길다. 대체로 1~2 주 정도는 한번 충전으로 거뜬하다. 게다가 가격도 저렴하다. 핏빗 살 정도에 몇만원만 보태면 페블을 구매할 수 있었다. 마침 그 즈음, 킥스타터에서 페블 2 를 펀딩하고 있었고 당장 신청했다. 몇개월이 지나서 비보가 들려왔다. 페블이 핏빗에 인수된다고 한다. 그리고 자연스럽게 펀딩은 취소되었다(허허, 만들던건 끝내야지… 내가 다시 킥스타터하나봐라…). 그렇게 몇개월간의 기다린 보람도 없이 내 새로운 시계는 사라져버렸다.</p>\n<p>포기할수 없었다. 한번 사기로 했으니 다른 브랜드를 더 찾아보기로 했다. 아무래도 배터리가 맘에 걸려 애플워치나 기어는 싫었다. 페블처럼 e-ink 를 사용하면서 배터리 지속시간이 긴 워치가 필요했다. 처음 발견한 워치는 카시오의 쥐샥이었다. 쥐샥은 대부분 시계 기능에 충실한 시계지만, 스마트폰과 연동 할수 있는 모델도 몇 개 있었다. 하지만, 출시된지 너무 오래되었고, 후속모델도 더이상 나오지 않는 상황이었다. 내 생각에는 카시오가 더이상 블루투스 모델을 만들 생각이 없는듯했다. 그래서 깔끔하게 접었다.</p>\n<p>그 다음 찾은 브랜드가 순토(suunto)다. 드디어 순토다. 순토는 핀란드위 위치한 스포츠 워치 전문 브랜드다. 대부분의 전자제품(?) 회사들은 본사에서 디자인하고 중국이나 동남아에서 조립하는게 일반적이지만, 순토는 제품의 대부분을 핀란드 현지에서 제작한다. 그래서 믿음이 간다. 핀란드하면 자일리톨밖에 모르는 사람이 많겠지만, 한때 핸드폰 시장을 장악했던 노키아나 게임업계의 공룡기업인 슈퍼셀이나 로비오 엩터테인먼트(앵그리버드 제작사)가 핀란드의 회사다.</p>\n<p>순토 시계는 (개인적인 취향이지만) 이쁘다. 그런데… 가격이 좀 비싸다. 고급모델은 100 만원도 넘는다. 물론 소재가 티타늄이나 사파이어 글래스인 경우지만, 보급 모델의 경우에도 거의 50 만원 이상은 필요하다. 너무 비싸서 새 제품을 살 엄두가 안났다. 그래서 중고나라, 번개장터, 셀잇 등 중고 거래가 가능한 곳이라면 어디든 다 검색해 보았다. 그러다 셀잇에서 트래버스 사파이어블랙 모델(이 정도면 훌륭한 디자인이다)이 저렴하게 나온걸 발견했다. 당장 질렀다. 트래버스는 트래킹에 최적화된 모델로, 내비게이션 기능이 탑재되어있다. 시계에 웬 내비게이션? 이게 무슨 기능이냐면, 미리 좌표를 찍어두고 길 찾기를 선택하면 방향과 거리를 계산해 어디로 가야할지를 알려준다. 또는 지난간 길을 기억해서 원점으로 되돌아 갈 수 있게 도와주는데, 덕유산 갔을때 한번 써본적 있다. 하지만, 한국의 산은 워낙에 길이 잘 닦여 있어 그닥 필요한 기능은 아니다. 이외에도 순토 시계(다이빙 전용을 제외하고)는 기본적으로 달리기나 싸이클 같은 운동의 데이터를 측정하고 분석한다. 모델에 따라서 수영이나, 등산 등 다양한 운동 수십여가지를 지원한다. 각종 센서와 기본으로 탑재된 GPS 로 거리와 움직임을 측정하고 심박센서로 칼로리 소모를 측정한다. 아주 좋다. 시계도 이쁘고 알림도 되고 운동 기능도 다양하다.</p>\n<p>거의 2 년가까이 사용하다보니 계속 눈에 거슬리는게 하나 있었다. 스마트폰에 뜨는 알림 메세지를 시계에도 보여주는데 메세지가 길어지면 짤려서 내용을 볼수가 없다. 특히 카톡같은 경우에는 대략 20~30 자 정도밖에 보여주지 않기 때문에 내용을 정확하게 알 수가 없었다. 이게 너무 불편했다. 시계에서 확인하고 싶은데, 메세지 앞부부만 확인하고 또 핸드폰을 켜야만 했다. 그리고 또 한가지, 순토에서 새로운 모델을 출시했다. 심박센서가 내장되었고 컬러모델(스파르탄 모델)이다. 지금까지 순토 시계에는 심박센서가 내장되어 있지 않았다. 별도의 센서를 사서 가슴부위에 착용한 후 운동량을 측정해야 했다. 아.. 말만 들어도 불편하다.</p>\n<p>\n  <a\n    class=\"gatsby-resp-image-link\"\n    href=\"/static/0-d3869296d081b84a13e40d98934be686-d3206.jpg\"\n    style=\"display: block\"\n    target=\"_blank\"\n    rel=\"noopener\"\n  >\n  \n  <span\n    class=\"gatsby-resp-image-wrapper\"\n    style=\"position: relative; display: block; ; max-width: 590px; margin-left: auto; margin-right: auto;\"\n  >\n    <span\n      class=\"gatsby-resp-image-background-image\"\n      style=\"padding-bottom: 75%; position: relative; bottom: 0; left: 0; background-image: url('data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAAPABQDASIAAhEBAxEB/8QAFwAAAwEAAAAAAAAAAAAAAAAAAAMFAf/EABUBAQEAAAAAAAAAAAAAAAAAAAEC/9oADAMBAAIQAxAAAAGhDciGiaD/AP/EABkQAAMAAwAAAAAAAAAAAAAAAAECAwATFP/aAAgBAQABBQK9dcpu1a89Bj3LCJ1HqGf/xAAVEQEBAAAAAAAAAAAAAAAAAAAAEf/aAAgBAwEBPwGI/8QAFhEBAQEAAAAAAAAAAAAAAAAAABEB/9oACAECAQE/Aauv/8QAHBAAAgICAwAAAAAAAAAAAAAAAAECIRESEDGR/9oACAEBAAY/AnJI1qypL0ccZNu+P//EAB0QAAICAQUAAAAAAAAAAAAAAAABIUFhEBExUXH/2gAIAQEAAT8hkYfC3FR3k6K2WBFQasZbOPNL/9oADAMBAAIAAwAAABCsz//EABYRAQEBAAAAAAAAAAAAAAAAAAEQEf/aAAgBAwEBPxBGz//EABcRAQADAAAAAAAAAAAAAAAAAAEQESH/2gAIAQIBAT8QFWxf/8QAGhABAQEBAQEBAAAAAAAAAAAAAREAIUFRkf/aAAgBAQABPxByQ4HRVldbWaiIQWc8xWIO9DRrVpAT7q4Bqb0e4AKP47//2Q=='); background-size: cover; display: block;\"\n    >\n      <img\n        class=\"gatsby-resp-image-image\"\n        style=\"width: 100%; height: 100%; margin: 0; vertical-align: middle; position: absolute; top: 0; left: 0; box-shadow: inset 0px 0px 0px 400px white;\"\n        alt=\"img0\"\n        title=\"\"\n        src=\"/static/0-d3869296d081b84a13e40d98934be686-f8fb9.jpg\"\n        srcset=\"/static/0-d3869296d081b84a13e40d98934be686-e8976.jpg 148w,\n/static/0-d3869296d081b84a13e40d98934be686-63df2.jpg 295w,\n/static/0-d3869296d081b84a13e40d98934be686-f8fb9.jpg 590w,\n/static/0-d3869296d081b84a13e40d98934be686-d3206.jpg 728w\"\n        sizes=\"(max-width: 590px) 100vw, 590px\"\n      />\n    </span>\n  </span>\n  \n  </a>\n    </p>\n<p>&#x3C;나의 순토 스파르탄 스포츠 HR></p>\n<p>사람 욕심은 끝이 없나보다. 잘 쓰던 트래버스 모델을 회사 동료에서 헐값에 넘겼다. 그리고 또 다시 폭풍 검색. 중고 사이트를 모두 뒤지다\n저렴하게 나온 스파르탄 스포츠 HR 모델을 발견했다. 당장에 직거래로 구매했다. 시계 외관은 솔직히 트래버스가 한수 위라 생각한다. 스파르탄\n모델은 뭔가 밋밋한 느낌이다. 터치스크린을 장착했기 때문이라 생각하지만 그래도 좀 아쉽긴하다. 하지만, 다양한 기능에 컬러 그리고 트래버스의\n주 기능인 내비게이션도 지원한다. 무엇보다도 스마트폰 알림 메세지를 전부 확인할 수 있다는게 너무 좋다.</p>","frontmatter":{"title":"최고의 스포츠 워치, 순토(suunto)","date":"July 27, 2018"}}},"pageContext":{"slug":"/2018/07/27/my_watch_suunto/","previous":{"fields":{"slug":"/2018/07/25/need_goal/"},"frontmatter":{"title":"목표를 가져야겠다"}},"next":{"fields":{"slug":"/2018/07/31/apartment_market/"},"frontmatter":{"title":"아파트 입주시장은 의외로 크다."}}}}