{"data":{"site":{"siteMetadata":{"title":"bono's blog","author":"bono"}},"markdownRemark":{"id":"17117edb-57d8-5348-b6f8-5f0b132cb2da","excerpt":"…","html":"<p>처음 프로그래머가 되고자 했을때는 해외에서 근무하고 싶었다. 구체적인 방법은 생각해본적 없지만 막연하게 해외 직장 생활을 동경해왔던것 같다. 해외에서 취업하기 위해서는 필요한것이 많겠지만, 누가 머라해도 가장 중요한 것은 영어(영미권이 아니라면 해당 나라의 언어, 앞으로는 영어로 대표한다)다. 일한다는 것은 의사소통이 전제되기 때문에 영어가 안된다면 해외 취업은 사실상 무리다. 아무리 실력이 뛰어난 프로그래머라도 기본적인(협업이 가능한(?)) 영어 실력 없이는 해외에서 직장을 구하기란 어렵다.</p>\n<p>한국인에게 영어는 가장 필요로 하지만, 가장 정복하기 어려운 것 중에 하나다. 2000 년대 학번의 대학생이라면 졸업을 위한 토익 시험을 한번쯤 봤을 것이다. 학과에 따라 다르지만, 대략 600~700 점 정도가 필요했던 것으로 기억한다. 영어관련 학과나 무역 또는 경영 관련 학과라면 졸업후에 영어가 필요할지도 모른다. 하지만 대부분의 학과는 졸업하고나면 영어를 사용하는 일은 거의 없다. 심지어는 이런 경우도 있다. 국문학과 출신의 소설가 지망생이 졸업 하기 위해 토익 공부를 해야한다. 이 얼마나 어불성설인가?</p>\n<p>인터넷에서 영어 공부방법을 찾아보면 정말 어마어마하게 많이 나온다. 광고도 많다. 세달만 따라하면 말이 술술 나온다던가, 몇 주 만에 자막없이 영화 볼 수 있다는 식이다. 아직 다양한 방법을 시도해 본건 아니지만, 대체로 실효성이 없다는 것에 다들 동의할 것이다(광고는 광고일 뿐). 몇 달 만에 기적같이 영어를 잘 할 수 있으면 그 누가 십수년간 고생하며 공부하고 있을까. 모든 일을 제쳐두고 영어에만 올인하면 6 개월만 열심히 해도 어느정도 성과가 있을것이다. 하지만, 유학을 준비하는 학생이 아니고서야 6 개월 정도의 시간은 할애 하기란 쉽지 않다. 그래서 직장인들이 할 수 있는 방법은 매일매일 조금씩 꾸준히 공부하는 것밖에 없다(너무 당연한가…).</p>\n<p>그런데 정말 그럴까? 그냥 조금씩 꾸준하게 공부 하기만하면 실력이 팍팍 늘까? 글쎄다. 나는 대략 1 년 전부터 매일 아침(주말 제외) 출근길에 미국 드라마(모던패밀리)를 반복 시청하고 있다. 한 편당 50 회를 반복한다. 일주일에 5 번 보게 되니까 한편을 다 보려면 10 주가 걸린다. 1 년이 지나면 대략 다섯 편 정도를 끝낼 수 있다. 1 년 정도 하다보니 습관이 들어서 매일매일 보고 듣는게 크게 힘들지 않다. 딱히 모바일 게임을 하는 것도 아니라서 다른데 시간을 뺏길 염려도 없다. 한 편을 50 번 반복해서 듣다보니 웬만한 표현은 알파벳 하나까지 다 들리기도 한다.</p>\n<p>그런데 이 방법이 효과가 있었을까? 1 년쯤 지나다 보니 정말 효과가 있을지 의문이 들기 시작했다. 별도로 영어 회화스터디를 하는것도 아니고 학원을 다니지도 않아서 내 실력이 늘었다는 걸 가늠 하기가 어렵다. 하지만 영어 뉴스를 듣거나 영화를 볼 때 예전에 비해서는 조금 편안하다는 느낌은 있다. 기존에는 영어 단어 하나 문장 하나를 곱씹어 생각하다 보니 정작 문맥을 놓치는 경우가 많았다. 영어 듣기에서 가장 중요한게 문맥이 아닌가. 한번 문맥을 놓치면 그 다음은 전혀 들리지 않는다. 그렇다고 불시에 외국인을 만나서 자유롭게 의사소통 하라면 할 수 있을까? 확신은 없다. 미리 할 말을 생각하고 말하면 가능할지 몰라도 갑자기 말해보라 하면 자연스러운 문장이 나오기는 힘들것 같다.</p>\n<p>1 년으로 성과를 바라는건 무리일 수 있다. 1 년 내내 영어만 공부했다면 모를까, 출근시간에만 잠깐씩 듣는 걸로 실력이 일취월장 하기를 바라는건 무리다. 그래서 앞으로 1 년 더 해볼 생각이다. 지금과 똑같이 할지 좀더 개선된 방법을 찾을지는 미지수다. 일단은 큰 변화없이 계속 이어나갈 생각이다. 계속 하다보면 욕심이 생기고 욕심이 생기면 더 나은 방법을 스스로 찾을꺼 같다. 굳이 조급하게 새로운 방법에 도전하는건 위험할 수 있다. 자칫 부담을 느껴 그만두는 사태가 발생할지도 모르기 때문이다. 이 글은 1 년 뒤에 다시 읽어볼 생각이다. 1 년 후에 이 글을 다시 읽었을때, 지금과 비교해서 얼마만큼의 성과가 있었고 변했을지 가늠해볼 수 있지 않을까?</p>","frontmatter":{"title":"1년 동안의 매일 아침 듣기, 효과 있었을까?","date":"July 03, 2018"}}},"pageContext":{"slug":"/2018/07/03/listening_english_everyday/","previous":{"fields":{"slug":"/2018/07/02/what_will_i_do/"},"frontmatter":{"title":"앞으로 뭐 먹고 살까?"}},"next":{"fields":{"slug":"/2018/07/04/interpret_text/"},"frontmatter":{"title":"텍스트는 해석하기 나름이다."}}}}