{"data":{"site":{"siteMetadata":{"title":"bono's blog","author":"bono"}},"markdownRemark":{"id":"f2b64bae-b650-5901-a5b3-798b51fde063","excerpt":"…","html":"<p>과거에 나는 산만한 독자였다. 맘에 드는 책 한권을 고르면 다 읽기 전에 또 다른 책을 집어들었다. 끌리는대로, 내 생각의 흐름에 따라 원하는 책을 읽었다. 건축서적을 읽다가도 재미있는 소설책이 있다는 소식을 들으면 당장에 구매했다. 만화책을 보고싶으면 언제든 만화책을 읽었다. 또 어떤 감명깊게 읽은 책에서 추천하는 책이 있으면 우선 구매하기 바빴다. 책을 사모으길 즐기는 탐서주의자였고, 책을 읽는 속도보다 사는 속도가 더 빨랐다. 책은 쌓여갔고 책장에는 펴보지도 않은 책으로 가득찼다. 그래도 역시나 책 읽기는 좋아했다. 시간이 날때마다 책을 읽었고, 많이 읽지는 못해도 항상 책은 가지고 다녔다. 그렇다. 책 읽기는 내 취미였다. 읽는 행위가 즐거웠고, 재밌었다. 그래서 내키는대로 읽었다. 그런데, 취미에 규칙같은 강제가 생기면 어떻게 될까? 예를 들어 책을 읽을때 한권을 완독할때까지 다른 책을 집어들면 안된다는 것이나 3 일에 반드시 한권은 읽어야 한다는 것처럼 말이다.</p>\n<p>취미의 독서라면 아무 문제 없다. 책을 완독하는게 중요한것도 아니고, 여러 권을 동시에 읽는다 해서 딱히 문제될건 없다. 여기서 취미의 독서라함은 흥미위주의 책읽기를 말한다. 텍스트를 읽는 목적이 오로지 즐기기 위함일때 흥미위주의 책읽기라 말한다. 소설이 될 수도 있고, 에세이가 될수도 있고, 만화책이나 무협지가 될수도 있다. 자신이 원하는 책을 선택해서 읽으면 된다. 취미기 때문에 규칙따위는 상관하지 않아도 된다. 독서 방법도 마음내키는데로 하면 된다. 원하는 부분만 발췌해서 읽어도 되고 빠르게 훑어봐도 된다. 또는 여러권을 동시에 읽어도 상관없다. 만화책을 읽을때 여러개를 동시에 읽는다고 해서 문제 될껀 없지 않은가? 실제로 연재속도가 느리다보니 여러권의 만화책을 동시에 읽는 사람이 대부분이다.</p>\n<p>그런데 이제는 독서 방법을 바꿨다. 기존의 방법이 잘못돼서 바꾼건 아니다. 기존의 방식도 훌륭한 독서 방법의 하나다. 즐겁지도 않은데 꾸준히 책을 읽으려면 얼마나 힘들겠는가? 다만, 내 독서 방법이 바뀐 이유는 독서의 목적이 바꼈기 때문이다. 예전에는 즐기기 위해 책을 읽었다. 하지만, 지금은 인생을 바꾸기 위해 책을 읽는다. 소프트뱅크의 손기정 회장은 시한부를 선고받고 병원에 입원한 3 년동안 무려 3000 권의 책을 읽었다고 한다. 언제 죽을지도 모르는 상황에서도 책에서 손을 놓지 않고 다가올 미래에 대비했던 것이다. 그렇다면, 책 읽는 방법만 바꾼다고 인생이 바뀔까? 가능하다고 생각한다. 다만, 적절한 전략이 필요하다.</p>\n<p>인생을 바꾸는 독서를 위한 전략은 두가지 측면에서 생각해야 한다. 첫번째는 책을 선택하는 방법이다. 우선은 내가 알고 싶고 관심가는 분야를 선정한다. 관심사가 정해졌으면 해당 분야의 입문서격인 책을 몇권 선택한다. 입문서를 선택하는 이유는 해당 분야에 대한 개괄적인 지식을 얻을 수 있기 때문이다. 만약에 처음부터 깊이있고 어려운 책을 고른다면 한권을 다 읽기도 전에 나가 떨어질지도 모른다. 입문서를 몇권 읽고 나면 자연스럽게 다음 읽고 싶은 책이 생긴다. 예를 들어 부동산 투자에 관한 책을 읽는다고 가정하자. 처음에는 부동산의 전반적인 흐름과 투자방식을 개괄적으로 알수 있는 입문서를 완독한다. 이후에는 몇가지 선택지가 생긴다. 아파트가 될수도 있고, 빌라가 될수도 있다. 또는 땅에 관심이 갈수도 있다. 아니면 경매라는 구매방식에 관심이 갈수도 있다. 또는 부동산 투자보다는 경제상황에 따른 부동산 흐름이나 거시경제로 눈을 돌릴수도 있다. 무엇이 됐든간에 분명 특정 분야로 관심이 쏠릴것이다. 그때는 이전에 읽었던 입문서에 소개된 책들을 읽어 볼 수도 있고, 서점이나 웹에서 관련 전문서를 찾아볼수도 있다. 입문서부터 전문서까지 최소 20 권(딱히 이유는 없고 내 기준이다)이상의 책을 읽어보자. 이때 중간에 다른 책은 읽지 않고 되도록 같은 분야의 책을 연속적으로 읽는것이 좋다. 중간에 다른 분야의 책을 읽으면 관심사가 바뀔수 있기 때문이다. 기껏 한 분야에 책 몇권을 읽고 다른 분야로 옮겨간다면 지금까지 읽은 책은 괜한 시간낭비가 될 수 있다. 한 분야의 책을 20 권 이상 읽기가 완료되면, 이전과는 조금 달라진 모습을 발견할지도 모른다. 예전에는 전혀 이해할수 없었던 글이나 기사가 이해되기 시작한다. 전혀 몰랐던 용어나 개념들이 이해되기 때문에 글이 술술 읽히고 내용도 머리에 쉽게 정리된다.</p>\n<p>두번째는 양적인 측면이다. 위에서 20 권을 읽는다고 했는데, 그렇다면 위에서 말한 20 권을 언제까지 읽어야 할까? 정해진 답은 없다. 본인이 원하는 기간을 잡고 읽으면 된다. 기간이 얼마가 되느냐 보다는 마감시간을 정하는 것이 중요하다(친구와 내기를 해도 좋고, 본인 스스로 약속을 해도 좋다). 어떤 분야의 책, 20 권을 읽는다고 가정하자. 책마다 양이 다르기 때문에 딱 잘라 말하기는 힘들지만, 한 권당 평균 3 일을 잡자(느리게 읽거나 시간이 없으면 더 길게 잡아도 된다). 그럼 3 일에 20 권이니깐 총 60 일, 두달이다. 두달 안에는 반드시 20 권을 읽도록 하자.</p>\n<p>마감 없이 책을 읽는다고 생각해보자. 그러면, 한권을 읽다가 한달이 지날수도 있다. 책이란게 모든 파트가 흥미롭지는 않기 때문에 늘어지는 부분이 있기 마련이다. 늘어지는 부분이 생기면 책 읽는 속도는 확연히 느려진다. 하지만 마감시간을 정하고 책을 읽으면 흥미롭지 않아도 늘어지지 않을 가능성이 높다. 마감시간이 강제성을 부여하기 때문이다.</p>\n<p>위에서 인생을 바꾸는 독서 전략에 대해 알아보았다. 나도 아직 말한것처럼 잘 지키지는 못한다. 회사 일이 바쁘면 조금 느려지기도 하고, 지금처럼 이사를 앞두고 있을때도 정신이 딴데 팔려있어서 책 읽는 시간이 부족할 때도 있다. 하지만, 내가 말한 방식을 꾸준히 잘 지킨다면, 정말 내 인생을 바꿀수 있다는 생각은 변함없다. 구체적으로 어떻게 바뀔지는 전혀 모른다. 아마 끊임없이 책을 읽는 과정 속에서 그 답을 찾아갈 수 있는게 아닐까 생각한다.</p>","frontmatter":{"title":"나의 책 읽는 방법","date":"July 21, 2018"}}},"pageContext":{"slug":"/2018/07/21/my_reading/","previous":{"fields":{"slug":"/2018/07/19/specialist_vs_generalist/"},"frontmatter":{"title":"스페셜리스트(specialist) vs 제너럴리스트(generalist)"}},"next":{"fields":{"slug":"/2018/07/25/need_goal/"},"frontmatter":{"title":"목표를 가져야겠다"}}}}