{"data":{"site":{"siteMetadata":{"title":"bono's blog","author":"bono"}},"markdownRemark":{"id":"6e0ffb17-a159-5516-8fc5-b43276c50427","excerpt":"…","html":"<p>곧 있으면 내집으로 이사다. 한달 남짓 남았다. 한창 설레야 할 시기에 머리가 아프다. 살고 있는집이 안나갔거나, 이사에 문제가 있거나 자금 융통이 어려워서가 아니다. 이사갈 지역에 아파트 단지끼리 싸움이 나서다. 새로 개발되는 지역에서 싸움 나는 경우는 흔하다. 모든게 새로 만들어지기 때문이다. 뭔가가 만들어질때, 한 단지에서 호재로 느끼는 것이 옆 단지에게는 매우 불편한 것일 수 있다. 생활에 직접적으로 불편을 주는 경우(이것 또한 돈으로 귀결된다고 본다)도 있겠지만 대부분은 돈과 관련된 일이다.</p>\n<p>나는 건축을 전공했고, 우리나라의 아파트를 혐오했다. 집을 살기 위한 것이지 사기 위한 것(투자의 대상)이 아니라고 생각했기 때문이다. 그래서 당시의 나는 절대로 아파트에 들어가 살지 않으리라 다짐했다. 지금 생각하면 철이 없었던것 같지만, 한편으로 그 소신을 지키지 못함이 안타깝다. 우리나라에서 아파트는 투자의 대상이다. 특히 아파트를 구매하는 사람들은 대부분 그렇게 생각한다. 처음에는 아닐지 몰라도 주변 환경의 변화와 국제 금융시장의 변화에 따라 시세가 오르락내리락 하는걸 보면 마음이 흔들릴수 밖세 없다. 예를 들어보자. 한 지역에 지하철 역이 생긴다. 지하철 역은 부동산에서 가장 큰 호재 중의 하나다. 당연히 역이 생기면 그 지역의 시세가 급등할 가능성이 높다. 그런데, 지금껏 비슷한 가격을 유지하던 옆 단지는 이게 불편하다. 옆 지역은 지하철 역이 생겨 1 억이 넘는(요즘은 1 억도 우습다) 시세 차익을 바라보는데, 본인들 지역은 시세 변화가 없으니 말이다. 배가 아플만하다.</p>\n<p>이사가는 아파트 지역에는 왜 싸움이 났을까? 한 단지가 시행사 비용으로 소음 방지를 위한 방음터널을 만들기로 했다. 방음터널은 구조상 출입구쪽으로 먼지가 집중된다. 그래서 주로 주택가가 아닌쪽으로 먼지를 배출해야한다. 그런데 이게 힘들다면 방음터널 내 집진시설을 만들거나 반방음 터널로 만들어야 피해를 최소화 할 수 있다. 그런데 완방음터널로 계획한 것이다. 옆 단지 입장에서는 억울함을 호소할 수 있다. 방음터널이 없어도 도로에서 어느정도의 먼지가 발생 하겠지만, 방음터널이 만들어짐으로 인해 먼지가 더 심하게 발생할수 있다. 그래서 싸움이 났다. 한쪽은 원안대로 할것이다, 한쪽은 피해가 가니 차선책으로 변경하거나 연장해 달라한다. 양쪽 주장다 일리가 있다. 그런데 이 문제가 쉽게 해결될 기미가 보이지 않는다. 방음터널이라는 것이 비용이 많이 들기도 하지만, 그 돈을 누가 부담할지 확실치 않기 때문이다. 또 다른 문제는 두 단지간에 한치의 양보도 없다는 것이다. 아마도 돈이 걸려있기 때문이다. 아니라고 하는 사람도 있겠지만 나는 본질은 돈이라 생각한다. 조금이라도 자신의 단지가 주변 단지보다 살기 좋은 곳이라고 알려진다면 향후 시세는 옆 단지보다 더 높아질게 분명하기 때문이다. 돈 앞에서 양보는 없다.</p>\n<p>그럼, 어떻게 하면 두 단지의 싸움이 끝나게 할 수 있을까? 당장의 방법은 없어 보인다. 이미 방음터널 문제로 틀어질때로 틀어졌는데, 갑자기 만나서 방법을 찾아보자고 하면 더 싸울게 뻔한다. 격한 감정싸움은 불필요하게 에너지만 낭비한다. 각자 원하는게 있으면 요구해야할 기관에 요구하면 된다. 요구가 합당하면 들어줄 것이고 아니면 안들어줄 것이다. 난 이 싸움을 그다지 심각하게 생각하지 않는다. 왜냐면 본질이 돈이기 때문이다. 지금은 이해관계가 달라 서로 헐뜻으며 싸우고 있지만, 추후에는 이해관계가 같은 사안도 있을것이다. 아마 그 때는 언제 그랬냐는듯 서로 합심해서 요구할 것이 분명하기 때문이다.</p>\n<p>가만보면 우리나라 국회의원들의 생존방식과 비슷하다. 우리나라는 자유한국당, 민주당 양당체제로 오랜시간 유지되어 왔다. 두 당은 서로 추구하는 방향이 너무 다르다. 한쪽은 지키자는 입장이고, 한쪽은 개혁이 필요하다는 입장이다. 어떤 사안은 다행히(?) 협의가 가능한 경우도 있다. 하지만 이 두 아파트 단지처럼 절대 물러설수 없는 사안도 있다. 그게 과열되면 국회에서 난투극이 벌어지기도하고 날치기 통과가 되기도 한다. 하지만, 두 당 모두에게 이익이 되는 일(예를들면 국회의원 연금법 같은…)은 어떠한 싸움도 없이 하나된 마음으로 빠르게 처리한다. 아파트나 국회의원이나 똑같다.</p>","frontmatter":{"title":"아파트 단지간 싸움은 칼로 물베기다?","date":"June 30, 2018"}}},"pageContext":{"slug":"/2018/06/30/apartment_dispute/","previous":{"fields":{"slug":"/2018/06/28/need_air_conditioner/"},"frontmatter":{"title":"에어컨을 설치할까? 한달을 참을까? 아니면??"}},"next":{"fields":{"slug":"/2018/07/02/what_will_i_do/"},"frontmatter":{"title":"앞으로 뭐 먹고 살까?"}}}}