{"data":{"site":{"siteMetadata":{"title":"bono's blog","author":"bono"}},"markdownRemark":{"id":"586d746c-7f16-5678-bdc0-67cb603e9425","excerpt":"…","html":"<p>오늘은 러시아 월드컵 본선, 대한민국과 맥시코의 경기가 있는 날이다(경기 시청 후 추가로 쓰는데, 졌다…). 스웨덴과의 첫번째 경기에서 이렇다할 공격을 보여주지 못했던 터라 큰 기대는 하지 않는다. 그래도 대한민국이라고 혹시나 하는 마음에 밤잠을 줄이고 시청할 생각이다. 16 강에 진출할 수 있을지 없을지는 모른다. 아마 안될꺼다. 운 좋게 멕시코를 이기더라도 다음 상대는 독일이다. 독일에게 최소한 비겨야 16 강을 생각할 수 있는데, 비기는 것 또한 만만치 않을 것 같다. 설령, 대한민국이 16 강에 오르지 못하더라도 결과와 상관없이 4 년간 열심히 준비해온 선수들에게 박수를 보내야 마땅하다고 생각한다.</p>\n<p>나는 소위 말하는 월드컵 학번이다. 2002 년에 대학생 새내기로 입학했다. 원래 축구를 좋아하는(엄밀히 즐겨했던) 편이라 1 학년 1 학기는 축제 같은 기간이었다. 한국과 일본에서 열리는 월드컵이었기 때문에 교수님들도 한국 경기가 있는 날은 강의를 쉬고 함께 응원하기도 했다. 만약, 내가 몇살만 더 많았더라면(특히 졸업반이었다면), 그때처럼 즐기지는 못했을게 분명하다. 학점 관리도 해야하고, 취업 준비도 해야하고, 영어점수 및 각종 자격증 공부에 마음이 편했을리 없다.</p>\n<p>그 이후로 여러번의 월드컵이 열렸다. 2006 년 독일 월드컵, 2010 년 남아공 월드컵, 2014 년 브라질 월드컵이 있었고 지금은 2018 년 러시아 월드컵이 한창 진행중이다. 나도 20 살이었던 2002 년을 지나 4 번의 월드컵을 거쳐 36 살의 청춘의 끝자락에 도달했다. 내가 나이를 먹어서인지 모르겠지만, 시간이 지날수록 월드컵에 대한 관심은 줄어들었다. 나만 그렇게 느끼는지 몰라도 사회 전반적으로 월드컵에 대한 관심이 많이 줄어든것 처럼 보인다. 예전에는 한국의 경기 뿐 아니라 축구 강국의 경기를 챙겨보고 친구끼리 누가 이길지 내기도 하는 등 주변 모두가 많은 관심을 보였다. 하지만, 지금은 한국의 경기 조차도 크게 관심이 없는 사람들이 더 많다.</p>\n<p>서형욱 축구해설위원(유튜브 링크)이 얘기했듯이 국가 단위의 스포츠가 점점 인기가 없어지는 것은 비단 우리나라 뿐만이 아니다. 20 세기는 수많은 전쟁과 분쟁으로 민족주의, 국가주의가 주류 이데올로기였다. 월드컵 같은 국가간 스포츠 경기는 애국심을 고취시키는데 아주 적절한 이벤트였다. 국가 대항전의 종합 이벤트인 월드컵이 인기가 있었던건 당연했다. 그러나 21 세기로 넘어오면서 전쟁이 많이 사라졌고 국가간의 왕래도 자연스럽고 빈번해졌다. 애국심으로 국가 대항전을 응원하기 보다는 자신이 좋아하는 선수가 뛰는 클럽에 더 관심을 가진다. 기업들마저 국가간 스포츠 보다는 선수 개인 또는 클럽에 더 관심이 많다.</p>\n<p>개인화도 이유가 될 수 있다. 요즘 사람들은 국가의 문제보다는 개인의 문제를 훨씬 중요시한다. 청년실업률이 높아 취직이 힘든 젊은이들은 스포츠 경기보다는 다음날 있을 시험이나 면접이 훨씬 중요하다. 어렵게 대기업에 취직 하더라도 생각과 다른 직장생활에 방황하는 친구들은 자신에게 맞는 삶의 방향을 찾기위해 고군분투 한다. 100 살 시대에 앞으로 50 년은 더 살아야할 50 대 가장에게 어쩌면 월드컵은 사치일지도 모른다. 조금이라도 더 나은 대학에 입학하기 위해 하루에도 몇개의 학원을 다녀야 하는 청소년들도 마찬가지다.</p>\n<p>월드컵을 위시한 국가 스포츠의 열기가 식어가는 것은 변화하는 세계처럼 당연한 수순이라 생각한다. 국가보다는 클럽이나 개인이 중요해지고, 자본의 흐름도 동일하게 흘러간다. 선수들마저 국가 대항전 보다는 클럽 대항전을 더 중요시 할지도 모른다. 국가 대항전에서 뛰다 부상이라도 당하면 자신의 몸값이 떨어지기 때문이다. 선수들이 예전만큼 열씸히 뛰지 않는것처럼 보인다고 해서(사실 다들 최선을 다해 열심히 뛴다) 그들을 욕할 수는 없다. 국가 대항전에서 부상당해 몸값이 떨어진다해도 국가가 그들에게 아무런 도움을 주지 못하기 때문이다.</p>\n<p>월드컵의 인기가 줄어들고 대회가 사라진다 해서 바뀌는건 없다. 다만 과거의 영광에 사로잡혀 현재를 보지 못하는 우를 범하지 말아야한다. 세상의 변화에 순응하고 받아들이는 태도를 가질 필요가 있다. 그럼 이제, 야구나 보자.</p>","frontmatter":{"title":"왜 사람들은 더이상 월드컵에 열광하지 않는가?","date":"June 24, 2018"}}},"pageContext":{"slug":"/2018/06/24/no_more_worldcup/","previous":{"fields":{"slug":"/2018/06/23/start_arduino/"},"frontmatter":{"title":"아두이노(arduino)를 시작해보자"}},"next":{"fields":{"slug":"/2018/06/24/what_is_good_book/"},"frontmatter":{"title":"양서는 누가 판단하는가? <돈과 시간에서 자유로운 인생 1인 기업>"}}}}