{"data":{"site":{"siteMetadata":{"title":"bono's blog","author":"bono"}},"markdownRemark":{"id":"a5b53f56-2d28-5720-a763-d8cfb00a70df","excerpt":"“아래 글에는 스포일러가 존재합니다” 히가시노 게이고 작품 네번째, ‘나미야 잡화점의 기적’(이하 ‘나미야’)을 완독했다. 일본에서는 잘 모르겠지만, 한국에서는 48 쇄를 찍을 정도로 출간이후부터 꾸준히 팔리고 있다. 출간되고도…","html":"<p><em>“아래 글에는 스포일러가 존재합니다”</em></p>\n<p>히가시노 게이고 작품 네번째, ‘나미야 잡화점의 기적’(이하 ‘나미야’)을 완독했다. 일본에서는 잘 모르겠지만, 한국에서는 48 쇄를 찍을 정도로 출간이후부터 꾸준히 팔리고 있다. 출간되고도 2 쇄를 찍지 못하는 책들이 수두룩한 출판시장에서 <em>48 쇄</em> 는 정말 경이로운 수치가 아닐 수 없다. 이전에 나왔던 ‘용의자 X 의 헌신’, ‘비밀’ 등 유명한 작품이 있었지만, 국내에서는 ‘나미야’를 통해 비로소 베스트셀러 작가에 이름을 올릴 수 있었다. 도대체 어떤 내용이길래 48 쇄나 되도록 꾸준함을 유지할 수 있었을까? 비로소 궁금함이 생겼다.</p>\n<p>‘나미야’는 추리소설이 아니다. 굳이 장르를 따지자면, 판타지 힐링소설쯤 되겠다. 대부분의 작품이 추리소설인 전문 추리소설 작가가 판타지라니? 게다가 힐링? 도대체 잡화점이라는 소재로 어떤 이야기를 만들어 나갈지 추측할 수 없었다.</p>\n<p>이야기의 시작은 세명의 루저(?) 청년들로 시작한다. 쇼타, 고헤이, 아쓰야 세사람은 아동복지시설 <em>‘환광원’</em> 출신이다. 어렸을 때부터 부모의 사랑을 받지 못하고 자라온 이들은 어른이 되어도 사회에서 환영받지 못한다. 한명은 회사에서 잘렸고, 다른 한명은 회사가 망해서 실업자가 되었다. 또 다른 한명은 누명을 쓰고 쫓기는 중이다. 그렇게 도망다니던 3 인조는 우연히 낡고 오래된 ‘나미야 잡화점’에 숨어들게 된다. 잠시만 밤이슬을 피하려던 그들에게 갑자기 편지가 한통 도착하고 이 편지로 인해 그들의 인생은 완전히 뒤바껴 버린다. 분명히 아무도 살지 않는곳인데, 편지가 온걸 의아하게 여긴다. 밖으로 나가봐도 사람이 다녀간 흔적은 찾아볼 수 없다. 이상하게 생각한 이들은 편지를 뜯게되고, 이 편지가 상담편지임을 알게된다. 답장을 쓸 처지는 아니었지만, 시간도 때울겸 장난 반 진심 반으로 편지에 답장을 하기 시작한다.</p>\n<p>30 여년전, 나미야 잡화점은 사람들의 ‘상담창구’였다. 처음에는 아이들의 장난스런 상담에 진심어린 답변을 해주던게 점점 커졌다. 나중에는 잠지에 실릴만큼 유명세를 타게된다. 어떤 상담에도 진심어린 답을 해주던 나미야 할아버지는 숨을 거두기 전, 아들에게 더이상 운영하지 않던 ‘나미야 잡화점’에 다시 한번 가자고 한다. 거기에서 미래에서 온 편지(그렇다. 나미야 잡화점은 시간을 초월하는 공간이다)를 읽은 나미야씨는 죽기전 아들에게 기묘한 유언을 전한다. 자신이 죽은뒤 30 주기가 되는 날, 단 하루만 ‘나미야 잡화점’을 다시 열어달라는 것이다. 아버지의 유언이 이상했지만, 잡화점에서 가지고 나온 편지들이 미래에서 온 것임을 알게된 아들은 아버지의 유지에 따라 정확히 30 년 후 ‘나미야 잡화점’을 연다. 그런데 우연히도 이날이 세명의 청년들이 잡화점에 숨어든 날이었다.</p>\n<p>30 여년 간의 시간을 오가며 나미야 할아버지와 3 인조의 상담 내용이 교차된다. 수십년간 상담 전문가(?)로 활동한 나미야 할아버지는 모르겠지만, 상담과는 전혀 거리가 먼 3 인조의 상담 내용은 정말 형편없다. 하지만, 그 답장을 읽은 사람들은 이상하게도 스스로 답을 얻는다. 상담을 통해 점점 진실에 접근하던 3 인조는 모든 이의 상담이 자신들이 어린시절을 보냈던 ‘환광원’과 연결됨을 깨닫는다. 사실 ‘환광원’은 나미야 할아버지가 젊은 시절 사랑에 빠졌던 여인이 설립한 복지 재단이다. 무슨 이유에선지 모르겠지만 어떤 인연의 끈을 통해 ‘환광원’출신 사람들의 고민을 나미야 할아버지가 들어주게 된 것 같다. 결국 모든 사실을 알게된 3 인조는 스스로 잘못을 뉘우치고 새로운 삶을 살기로 결심하고 이야기는 막을 내린다.</p>\n<p>‘나미야’는 정말 재미있는 소설임에는 틀림없다. 추리소설이라고 할 수는 없지만, 충분히 재미있는 요소를 갖추고 있다. 이야기의 중심 흐름은 모두 다르지만, 결국에는 ‘환광원’으로 연결된다. 30 년의 세월을 오가면서 오갔던 상담이나 잡화점에 들어오기 전 3 인조가 겪은 사건, 그리고 그들의 상담내용 모든 것들이 아우러져 하나의 거대한 이야기를 만들어낸다. 가히 수십년간 추리소설을 써온 작가의 내공이 느껴지는 부분이다.</p>\n<p>그렇다고 완벽하지는 않다. 판타지며 SF 기 때문에 모른척 넘어갈 수 있는 부분이지만, 30 년의 시간이 어떤한 방식으로 연결되는지 그 인과관계는 명확히 드러나지 않는다. 또한 어째서 30 년 전의 편지 일부가 30 년 후의 3 인조에게 전달되는지도 아이러니하다. 아마도 나미야 할아버지가 죽고나서일듯 한데 정확히는 알수 없다. 또한 ‘환광원’을 설립한 여인과 나미야 할아버지가 젊은 시절 사랑하는 사이었다고 해서 ‘환광원’과 관계된 사람들의 고민을 들어준다는 설정 또한 당위성이 부족해보인다. 히가시노 게이고가 추리 작가가 아니었다면 그다지 아쉽다고 생각하지 않았을것 같다. 하지만, 치밀한 추리소설을 그렇게나 많이 집필한 히가시노 게이고기 때문에 아쉬운 마음은 어쩔수 없는것 같다.</p>","frontmatter":{"title":"추리소설 작가의 힐링 소설 <나미야 잡화점의 기적 : 히가시노 게이고>","date":"September 04, 2018"}}},"pageContext":{"slug":"/2018/09/04/healing_mystery/","previous":{"fields":{"slug":"/2018/08/31/disadvantages_role_model/"},"frontmatter":{"title":"롤모델이 독이 될지도 모른다."}},"next":{"fields":{"slug":"/2018/09/15/pass-by-reference/"},"frontmatter":{"title":"[javascript] call by value"}}}}