{"data":{"site":{"siteMetadata":{"title":"bono's blog","author":"bono"}},"markdownRemark":{"id":"575c2687-c40c-534f-9a95-bd8d84bc64d8","excerpt":"- — layout: post comments: true title: 건축에서 프로그래머로(1) - 건축에 뜻을 두다 date: 2014-10-06 12:02:23.000000000 +09:00 type: post published: true…","html":"<p>-— layout: post comments: true title: 건축에서 프로그래머로(1) - 건축에 뜻을 두다 date: 2014-10-06 12:02:23.000000000 +09:00 type: post published: true status: publish categories: essay tags: - arcitecture - programmer - 개발 - 건설 - 건축 - 대학 - 미래 - 직업 - 프로그래머 meta: _aioseop_keywords: 개발, 건축, 프로그래머, arcitecture, programmer, 건설, 미래, 직업, 대학 _thumbnail_id: ‘1606’ _wpas_done_all: ‘1’ dsq_thread_id: ‘3087093054’ _edit_last: ‘1’ _wp_jd_target: <a href=\"http://www.whynhows.com/?p=1601\">http://www.whynhows.com/?p=1601</a> _wpt_short_url: ” _wpt_failed: ‘a:5:{s:6:“author”;b:0;s:8:“sentence”;s:105:“Post Edited: 건축에서 프로그래머로(1) - 건축에 뜻을 두다 <a href=\"http://www.whynhows.com/?p=1601%22;s:5:%22error%22;s:113:%22This\">http://www.whynhows.com/?p=1601”;s:5:“error”;s:113:“This</a> tweet is identical to another Tweet recently sent to this account. Twitter requires all Tweets to be unique.”;s:4:“code”;i:403;s:9:“timestamp”;i:1415164229;}’ _wpt_status_message: This tweet is identical to another Tweet recently sent to this account. Twitter requires all Tweets to be unique. author: login: blueshw email: blueshw83@gmail.com display_name: blueshw first_name: ” last_name: ” ---</p>\n<p>어렸을적엔 그림그리는 화가가 되고 싶었습니다. 그림 실력이 그렇게 뛰어나진 않았지만 그림 그리는게 마냥 즐겁고 행복 했었습니다. 누가 시키지 않아도 하루종일 그림 그리는데 몰두하기도 했었지요. 그림뿐만 아니라 만드는데도 흥미가 있었습니다. 약품 박스로 로보트를 만들기도 하고 철사로 이것저것 만들어보기도 했었지요. 하지만, 시간이 지나 중학생이 되고 고등학생이 되면서 예전처럼 그림에 대한 흥미는 사라지고, 대신 여느 아이들처럼 대학을 위한 입시에만 정신이 팔려버리게 되었습니다. 20살, 드디어 대학생이 되었습니다. 제게 20살은 해방의 시간이었습니다. 그때는 ‘앞으로 무었을 하겠다’ 보다는 ‘지금은 놀자’ 란 생각으로 머리속이 가득차 있었지요. 매일같이 친구들, 여자친구와 어울리면서 밤이면 밤마다 술자리에 흥청망청 시간을 보냈습니다.</p>\n<p>당시 제가 들어간 대학은 입학해서 2학년이 되기 전에 과를 선택하는 학부제로 운영되고 있었습니다. 1학년때는 특정 과가 정해져 있지 않고 교양위주의 수업을 들으면서 자신의 진로를 탐색하는 시간이었지요. 이런 방식이 어떻게 보면 긍정적으로 보일지 모르나 사실은 진로 선택을 1년 미루는것 밖에 되지 않는다고 생각합니다. 아직 아무것도 정해져 있지 않다는 생각은 자연스럽게 미래의 나를 생각하는것을 미루게 만들었습니다. 어차피 1년이 지나고 학과를 선택하면 그때부터 시작하면 된다고 그렇게 믿었지요. 그렇게 1년이 순식간에 지나고 선택의 시간이 다가왔습니다. 20년을 살면서 자신의 미래를 위해 제대로된 선택을 한것도 그때가 처음이 아닐까 생각이 듭니다. 고등학교를 다닐때까지는 거의 모든것이 정해진대로, 크게 다르지 않은 삶을 살았습니다. 선택을 하더라도 미래에 크게 영향을 주지 않는 선 안에서 이뤄졌습니다. 대학을 선택하는 시간도 있었지만, 학부로 지원을 했기에 당시에도 별다른 고민은 없었지요. 그런데 드디어 내가 미래에 어떤 삶을 살아야 하는지를 결정하는 시간이 다가왔습니다.</p>\n<p>고민이었습니다. 애초에 전자공학과 정도를 염두에 두고 있었습니다. 전자공학은 인기가 있는 학과여서 어느정도의 학점이 필요로 했지만 그정도의 학점은 충분했습니다. 그래서 외부의 조건이나 환경과는 전혀 상관없이 오로지 나 자신만을 위해서 고민을 하기 시작했습니다. 1년간 별다른 고민없이 지내온 기간이 어쩌면 도움이 됐는지도 모르겠습니다. 문득 어렸을적 시절을 생각해보았습니다. 15권 가량되는 백과사전의 예술분야와 관련된 13번째 책, 그 책 속에서 수없이 보아왔던 이미지 하나가 떠올랐습니다. 집을 만드는것! 건축이었습니다.</p>\n<p>뭔가 운명이 찾아온것처럼 건축공학과(당시는 건축학과 건축공학 분리없이 건축공학이었습니다)에 지원했습니다. 2학년은 1학년과는 다른 시간이었습니다. 건축이라고는 집짓는것이라는것 외에는 아무것도 모르던 제가 건축이 이런것이구나라는걸 깨달아가는 시간이었습니다. 다양한 분야의 책을 읽고 좋은 친구들을 만나고, 많은 이야기를 나누었습니다. 어설픈 실력에도 밤을 꼬박 새면서 작업한 결과물로 교수님에게 칭찬이라도 한번 받게으면 간밤의 피로는 말끔히 사라지고 더없이 행복했었지요. 하지만 대부분은 깨지고(설계 개념이나 모델 등을 평가 받는 것을 critic이라고 합니다), 부시고 다시 만드는 일의 반복이었습니다. 이런 반복의 시간동안 나도 세계적인 건축가들과 어깨를 나란히 하고싶다는 생각이 조금씩 자라나고 있었습니다.</p>\n<p>기나긴 방황의 시간을 보내고 드디오 졸업, 취업이 목전에 다가왔습니다. 여기서도 갈등이 찾아왔습니다. 건설회사(이른바 대기업)는 아예 쳐다보지도 않았습니다. 애초에 설계(건축디자인)를 위해 건축을 선택한 것인데 현실적인 조건(연봉, 네임밸류) 때문에 건설회사에 간다는 것은 자존심이 허락치 않았지요. 대신 큰 회사규모의 기업형 설계사무소에 들어갈 것이냐, 아니면 이른바 작가풍의 건축가 밑으로 들어가서 건축에 대해 제대로 배우로 갈것인가를 결정해야 했습니다. 아무래도 기업형 설계사무소에 들어가면 후자에 비해서 연봉은 조금더 높습니다. 하지만 진짜 건축일을하기 보다는 회사가 요구하는 회사가 원하는 일을 해야했지요. 하루종일 PPT를 만들거나, 말도 안되는 이야기를 갖다 붙이며 ‘이것이 작품입네’하고 과장하고 부풀리는 그런 일들이었지요. 네, 제가 해봐서 아는것입니다. 즉, 제가 선택한 길은 건축가 밑에서 일하며 배우는 것이 아니라 기업형 회사를 선택했다는 말입니다. 이때 후자의 길을 택했다면 아마도 아직 건축계에 발을 붙이고 살았을지도 모를 일입니다.</p>\n<p>회사 초창기에는 외부 공모전에도 여러번 참여 하고 입상하는 등 학생때의 열정을 이어 갔습니다. 하지만, 회사생활은 쉽지 않았고 밤을 새가며 일도 많이했지만 학생때와는 전혀 다르게 얻는것은 별로 없었습니다. 학교다닐때처럼 밤을 새가며 모형을 만들어도, 발표준비에 PPT를 만들어도 예전의 그것과는 전혀 달랐습니다. 그러다보니 ‘아, 이게 과연 내가 생각했던 건축인가’와 같은 고민들도 자주하게 되었습니다. 이일들은 내가 학생때 배우고 익혔던 이상적이고 훌륭하고 자부심 넘치는 건축이라는 학문이 아니었습니다. 이것은 단지 회사일 그 이상 그 이하도 아니었습니다.</p>\n<p>한편으로는 회사의 이런 모습이 이해가 가기도 했습니다. 건축은 학문이 아니라 경제적인 부분으로 프로젝트가 좌지우지되는 현실적인 ‘사업’이기 때문에 이상적인 모습만을 쫓을 수는 없는 노릇입니다. 하물며 이윤을 추구하는 집단인 회사에서 건축이라는 타이틀을 가지고 있으니 뭔가 멋있고 남들이 이해하지 못하고 비효율적인 프로젝트를 어마어마한 돈으로 실행할수는 없는 노릇입니다. 당연히 누군가의 요구와 누군가의 이해관계에 의해서 그들이 원하는 작업을 빠르고 효율적으로 처리해야하죠. 그래야 회사의 직원 모두가 먹고 살수 있는 것입니다.</p>\n<p>이해가 갔지만, 그래도 저는 싫었습니다. 이런저런 고민들로 점점 지쳐가고 있을 때, 어느 날 같은 회사의 10년차 선배님이 농담 삼아 제게 이런 말씀을 하셨습니다. “지금의 내 모습이 바로 10년 후의 니 모습일꺼야” 물론 농담이었지만, 이 말을 듣는 순간 뜨끔할 수 밖에 없었습니다. 10년이 지나면 30대 후반의 나이인데, 이런 회사에서 지금과 다를바 없이 일하고 있을 상상을 하니 눈앞이 캄캄하더라구요. 도저히 이건 아니다라는 생각이 들었습니다.</p>\n<p>결국 저는 1년 5개월이라는 짧은 기간이 지난 후 과감히 회사를 내팽개치고 나와버렸습니다. 무려 6~7년간의 열정이 1년 남짓한 시간만에 연기처럼 사라져버린 것이었습니다. 프로그래머로 살고 3년째 살고 있는 지금도 가끔 건축에 대한 향수에 젖어듭니다. 특히 당시에 같이 작업하고 고민하던 친구, 선배들이 자기의 길을 변함없이 묵묵히 걸어가고 있는 모습을 보면 더더욱 그리워지곤 합니다. 그래도 돌아갈 수 없습니다. 이는 마치 헤어진 여자친구를 다시 만나는 것처럼 부질없는 일임을 잘 알기 때문입니다.</p>","frontmatter":{"title":"","date":null}}},"pageContext":{"slug":"/from-architect-to-progammer-1/","previous":{"fields":{"slug":"/from-architect-to-progammer-4/"},"frontmatter":{"title":""}},"next":{"fields":{"slug":"/from-architect-to-progammer-3/"},"frontmatter":{"title":""}}}}