{"data":{"site":{"siteMetadata":{"title":"bono's blog","author":"bono"}},"markdownRemark":{"id":"52887a78-8891-5532-9175-173aa4143e50","excerpt":"…","html":"<p>요즘, 습관으로 만들려고 노력하는 두 가지가 있다. <strong><em>하나는 글쓰기, 하나는 마라톤</em></strong> (아래부터는 달리기로 쓰겠다)이다. 글쓰기는 시작한지 세달 정도 지났고, 달리기는 시작한지 겨우 한달밖에 안됐다. 두 가지 모두 저녁시간을 활용한다. 출근이 늦기 때문에 아침 시간을 이용할 수도 있지만, 죽었다 깨어나도 아침은 무리다. 일어나지 못하기 때문이다. 예전에 몇 번 아침 일찍 운동하려고 헬스장 등록도 해봤다. 하지만, 대부분 세 달을 넘기지 못했다. 그래서 아예 아침에 뭔가 하겠다는 생각은 접었다. 대신 조금 늦게 자더라도 저녁시간을 활용하기로 했다. 물론, 저녁 시간도 제약은 많다. 예를들어, 회사일이 바빠 늦게까지 야근해야 할 수도 있고, 갑자기 저녁약속이 생길수도 있다. 또는 몸이 아파서 휴식을 취해야할때도 있다(실제로 지난주 내내 아파서 글이고 달리기고 아무것도 못했다). 만약 집에 일찍 왔다 하더라도 집에는 아이가 기다리고 있다. 저녁을 먹고 아이가 잠들기 전까지는 아이와 시간을 보낸다. 내가 하고싶은 일도 중요하지만, 아이와 보내는 시간이 훨씬 중요하다 생각한다. 10 시 30 분쯤 되면 아이가 잠이 드는데, 이때부터 나를 위한 시간이 시작된다.</p>\n<p>내가 글쓰기와 달리기를 습관으로 만들려는 이유는 무엇일까? 처음부터 두 가지를 같이 하려던 생각은 없었다. 글쓰기는 오랜 숙원이었기 때문에 이번에 제대로 해보자는 생각이었다(벌써 잘 안한다ㅠㅠ). 달리기는 아마 이사하면서 시작하게 된것같다. 이사한 집 앞에 하천이 흐르는데, 정비도 잘 되어있어 달리기 딱 좋다. 특히 지금은 더위가 한풀 꺾이고 여름이 지나가는 시기(8 월 중순부터 10 월)라 더욱 달리기 좋은 환경이다. 그렇게 처음 한 두번 뛰어보니 욕심이 났고 마라톤에 도전해보고 싶다는 생각까지 하게되었다. 그래서 본격적으로 달리기도 꾸준히 해보자고 마음먹었다. 이렇게 나의 글쓰기와 달리기가 시작되었다.</p>\n<p>어느날, 하천 변을 달리다보니 달리기와 글쓰기가 비슷한점이 많다는 생각이 들었다. 글쓰기도 그렇고 달리기도 그렇고 해보면 알지만, 정말 인내가 필요하다. 글 하나를 쓰려면 주제 선정부터 시작해 마지막 문장을 쓸때까지, 글을 채워나가는게 보통일이 아님을 알 수 있다. 글의 종류에 따라 다르지만, 짧게는 2 시간에서 길게는 4~5 시간 정도가 소요 되기도 한다. 아이가 잠들고 10 시 30 분부터 쓰기 시작하더라도 빨리 자야 1 시, 늦으면 3 시까지 못자기도 한다. 시간이 너무 늦어지면 하루에 하나의 글을 완성하지 못한다. 어쩔수 없이 이틀이나 사흘에 걸쳐 완성해야한다.</p>\n<p>글을 꾸준히 쓰기는 훨씬 어렵다. 하나의 글을 쓰는것은 몇시간 고생하면 된다. 하지만, 며칠에 한번 또는 일주일에 세번, 이렇게 빈도를 정해놓고 글을 쓰다보면 점점 나태해지기 쉽다. 나도 처음 글쓰기 시작할때는 일주일에 5 개를 쓰겠다고 다짐 했다가 한달 쯤 지나 3 개로 줄더니 이제는 일주일 내내 하나도 안쓸때도 있다. 물론 다양한 소재로 일주일에 몇개씩 글을 쓴다는게 쉬운 일은 아니다. 소재가 풍부하려면 다양한 사람도 만나고 책도 많이 읽어야한다. 그리고 사람을 만나고 책을 읽는것으로 끝내서는 안된다. input 이 들어온만큼 생각도 많이하고 정리도 해야하다. 그래야 제대로된 output 이 나온다. 강한 의지도 필수다. 처음에는 정신의 근육이 글쓰기를 거부하기 때문에 강한 의지가 없으면 지속적으로 글쓰기 힘들다. 언젠가는 습관처럼 몸에 배이는 날이 올것이라 믿으면서 그렇게 노력해야한다.</p>\n<p>달리기도 비슷하다. 규칙적으로 같은 곳을 달려본 사람은 알겠지만, 정말 재미없다. 마음이 맞는 사람과 같이 달리면 좀 낫지만, 혼자 달리거나 런닝머신 위에서 뛸때면 이렇게 재미없는 운동이 또 있겠나 싶다. 그래서 꾸준히 하기 어렵다. 같은 코스를 매일 달린다고 생각해보자. 웬만큼 강한 의지가 없으면 며칠만 지나도 지겨워지고 그러다보면 점점 달리지 않게 된다. 아무런 동기부여가 없으면 나도 똑같이 그렇게 될것을 뻔히 알고 있다. 그렇기 때문에 <em>마라톤 대회 참가</em> 라는 목표를 설정했다. 그것도 한 두달에 한번씩 꾸준히 참가하는게 목표다. 아무래도 목표가 있으면 없을때보다는 조금 덜 강한 의지만으로도 충분히 이어갈수 있다.</p>\n<p>나는 끈기가 부족한 사람이(었)다. 정말 부족하다. 쉽게 포기하고 오랫동안 지속하는걸 힘들어한다. 그래서 뭐하나 제대로 잘한다 할 만한 것이 없다. 끈기를 키워야할 필요가 있다. 뭐하나 시작하면 끈질기게 물고늘어질 그런 끈기말이다. 없던 능력이 갑자기 생기지는 않겠지만 노력하면 충분히 키울 수 있다. 끈기를 키우기에 가장 좋은 것이 바로 글쓰기와 달리기다. 두가지 다 짧은 시간 노력한다고 빠르게 능력이 향상되지 않는다. 오랜시간 공을 들여야 하고 꾸준히 규칙적으로 해야 한다. 하지만, 오랫동안 지속하면 반드시 성과를 얻을 수 있다. 이건 확실하다(그렇게 믿는다). 나는 글쓰기와 달리기로 나를 개조할 생각이다. 그 동안 쉽게 포기하고 나태한 나를 바꾸기 위해 글쓰기와 달리기를 도구로 사용할 생각이다. 아마 처음에는 많이 힘들것이다. 머리는 글을쓰기 싫어할것이고 몸은 달리기를 거부할 것이다. 초반 몇달이 고비가 될것 같다. 조금만 참자. 조금만 참고 견뎌보자. 글쓰기와 달리기가 내 일부가 될때까지만 참아보자.</p>","frontmatter":{"title":"글쓰기와 마라톤의 공통점","date":"September 20, 2018"}}},"pageContext":{"slug":"/2018/09/20/writing_and_marathon/","previous":{"fields":{"slug":"/2018/09/18/review_2018_mirun_seoul/"},"frontmatter":{"title":"2018 아디다스 마이런 서울 후기"}},"next":null}}