{"data":{"site":{"siteMetadata":{"title":"bono's blog","author":"bono"}},"markdownRemark":{"id":"9007a863-cd08-5416-9cb5-27e57c4a1dc8","excerpt":"…","html":"<p>오랜만에 이케아를 다녀왔다. 다음달 초에 이사하는 아파트에 필요한 가구를 사기 위해서다. 처음 이케아 광명점이 오픈할때만 해도 주차장에 들어가는데 한두시간은 기본으로 기다려야했다(그 때 가보진 않았지만 지인에게 들었다). 오픈한 이후로 처음만큼은 아니지만 주말만 되면 이케아에 들어가려는 차로 도로가 마비되었다. 그나마 최근에 고양점이 생긴 이래로 고객이 분산되면서 조금 나아진 것 같다.</p>\n<p>도로에서 10 여분 기다려 주차하고 매장에 들어섰다. 오후 1 시가 넘은 아직은 이른 시각이라 조금 여유로워 보였다. 그렇다고 한가하지는 않았다. 이케아는 역시 이케아다. 오늘의 목적은 소파와 옷장이다. 이사를 하면서 사고 싶었던 가구를 모두 사면 좋겠지만, 언제 또 이사갈지도 모를 일이라 필요한것만 최소한으로 구매하기로 했다. 그렇게 결정한것이 소파와 옷장이다. 소파 코너에 들어서니 역시 이케아라는 생각이 들었다. 소파 하나만해도 수십가지가 있다. 1 인 소파부터 3 인, 코너형 등 형태도 다양하다. 또 소재나 기능에 따라서 가격도 천차만별이다. 정말 고르기 쉽지 않다.</p>\n<p>이케아가 지금처럼 세계적인 기업이 된 이유가 여러가지 있겠지만, 소비자가 직접 조립한다는 점이 크게 작용했다. 우선 소비자가 직접 조립하면서 인건비가 크게 감소했다. 가구를 운반할 배송기사도 필요없고(지금은 배송 서비스를 하고 있다), 설치기사도 필요없었다. 마트처럼 전시하고 계산하고 청소하는 직원이 대부분이었다. 인건비가 크게 들지 않으니 자연스레 제품의 가격을 낮출 수 있었다. 저렴한 가격과 더불어 특히 남자들에게는 직접 가구를 만든다는것이 하나의 놀이처럼 인식되었다. 가격도 저렴하고 직접 만들어도 볼수 있는 이케아 가구에 전세계 사람들은 열광했고, 세계적인 기업으로 성장할 수 있었다.</p>\n<p>가끔 뉴스에 이런 기사가 나온다. 폐목재로 가구를 만들었다거나, 소파를 쓰레기 솜으로 만들었다는 기사다. 책장, 장농, 침대, 소파 등 대형 가구들은 속까지 잘 안보인다. 양심불량 업체들이 단가를 낮추기 위해 속에 사용하는 재료를 폐목재나 쓰레기 솜을 사용한 것이다. 어떻게 소비자가 모를수 있나 생각되지만, 겉이 멀쩡하고 기능상 문제가 없으니 굳이 속까지 살펴보는 소비자가 거의 없었기 때문에 이런일이 벌어진 것이다.</p>\n<p>과거에는 가구가 무척 고가였다. 결혼할때 남자는 집을사고, 여자는 혼수로 가구와 가전을 샀다. 지금이야 집값이 워낙에 비싸기 때문에 이런 공식이 성립하기 어렵지만(아직도 이렇게 해야된다고 생각하는 사람이 많은것 같다), 과거에는 비용이 비슷할만큼 고가인 가구가 많았다(아마도 거품이 심했을거 같다). 20~30 년 전에도 10 자 장농이 2~3 백만원에 팔린 정도였으니 말 다했다. 그런데 이케아가 팔리기 시작했다. 초기에는 인터넷 직구로 구매했다. 인터넷 직구로 구매해도 국내에서 파는 가구보다 훨씬 저렴하게 구입할 수 있었다. 당연히 사람들은 직구로라도 이케아 가구를 사기 시작했고 점점 그 수가 많아지다보니 국내 가구 업체들은 긴장하기 시작했다. 어쩔수 없이 단가를 낮출수 밖에 없었다. 저렴하고 품질이 나쁘지 않은(좋다고 할수만은 없다, 각성비가 좋을뿐) 이케아를 이기기 힘들었기 때문이다. 결국 가구업체들은 살아남기위해 품질을 높여 고가 전략을 취할지 아니면 단가를 낮출지 둘 중 하나를 선택해야만 했다. 그런데 후자를 선택한 업체들이 단가를 낮추는데는 한계가 있었다. 인건비는 자꾸 올라가는데 단가를 낮추기란 사실상 불가능했던 것이다. 그래서 사람들 눈에 안띄는 부분을 폐목재나 재활용 부품으로 만들어 단가를 낮춘것이다. 겉은 멀쩡했기 때문에 제품을 구매한 소비자들은 알 방법이 없었다. 하지만 시간이 지나고 점차 제품에 문제가 있다는 생각을 한 소비자가 나타나기 시작했다.</p>\n<p>악덕 가구 업체의 이런 행태는 국내 모든 가구업체의 불신으로 이어졌다. 단 몇개의 악덕 업체만 쓰레기 재료를 사용했을 것이다. 소비자들은 완제품 가구에 의심을 하기 시작했다. 이는 오히려 이케아의 인기에 불을 지폈다. 사람들은 속에 어떤 재료가 있는지도 모를 제품을 구매하지 않은 것이다. 완성된 채로 배달되는 가구(요즘은 배달후 조립하는 가구도 많이 늘었다)보다는 이케아와 같이 직접 조립하는 가구들은 소재를 전부 알수 있었기 때문에 이케아를 신뢰했다.</p>\n<p>오늘 나도 소파를 둘러보고 나서 고민이 생겼다. 이케아 가구가 전부 저렴하지는 않다. 비싼것도 꽤 많다. 그런데 내가 사고 싶은 소파가 꽤 고가에 속한다. 인터넷을 찾아보니 한 국내 업체도 이와 비슷한 형태와 기능으로 만들어진 제품을팔고 있었다. 게다가 설치와 조립까지 모두 해준다. 그런데 가격은 절반 수준이다. 순간 위에서 언급했던 뉴스가 생갔났다. 혹시 가구의 재료가 저렴한건 아닌지 의심이 생긴것이다. 만약에 쓰레기 목재나 솜을 사용한건 아닐까? 조립까지 직접하는 이케아가 왜 더 비쌀까? 어떻게 할지 모르겠다. 가격이냐, 믿음이냐?</p>","frontmatter":{"title":"이케아를 다녀왔습니다.","date":"July 08, 2018"}}},"pageContext":{"slug":"/2018/07/08/went_ikea/","previous":{"fields":{"slug":"/2018/07/06/wood_slab_table/"},"frontmatter":{"title":"아파트와 우드슬랩 식탁이 어울릴까?"}},"next":{"fields":{"slug":"/2018/07/09/single_or_double_sentences/"},"frontmatter":{"title":"단문과 복문 <유시민의 글쓰기 특강>"}}}}